{
  "lomitacity.com_home": {
    "url": "https://lomitacity.com/",
    "title": "Home - City of Lomita",
    "content": "Home Sara Madsen 2025-03-20T08:44:19-07:00 WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Click here to watch WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Learn More WELCOME TO Lomita, California Click here to watch   Agendas & Minutes Pay a Bill Request a Service Register for Classes Upcoming Events Apr 11, 2025 Spring Concert Mariachi Night View Detail Apr 19, 2025 Eggstravaganza Lomita Park 24428 Eshelman Ave View Detail May 04, 2025 Health For All Ages Fair Lomita City Hall 24300 Narbonne Avenue View Detail May 09, 2025 Spring Concert Country Night City Hall Front Lawn View Detail Jun 28 - 29, 2025 Founders Day 2025 Downtown Lomita Narbonne Ave View Detail Nov 11, 2025 Veterans Day Ceremony Veterans Park 257th Street / Walnut Street View Detail Dec 05, 2025 Tree Lighting Ceremony View Detail Latest News Road Construction Delay Along Walnut St. (including 241st St., April Ct., Callison St., Terrell St., and Nordman St.) Read More Shaping Lomita’s Future: General Plan Update Underway Read More City of Lomita Launches New CIP Webpage to Showcase Public Works Projects Read More City of Lomita Announces 2024 Employee of the Year Read More City of Lomita Kicks Off the Holiday Season with Annual Holiday Tree Lighting Ceremony Read More Free Steering Wheel Locks for Car Owners at Lomita City Hall Read More 1 2 Next Load More Posts Skypark Commercial Properties Investigation Updates Lomita Fast Facts 20,921 Total Population $71,606 Median Household Income $604,300 Median Home Value 1.9 Square Miles 40.1 Median Age 35.3% Bachelor’s Degree or Higher",
    "depth": 0,
    "scraped_at": "2025-04-03 18:43:04"
  },
  "lomitacity.com_author_tsasara": {
    "url": "https://lomitacity.com/author/tsasara/",
    "title": "Sara Madsen - City of Lomita",
    "content": "About Sara Madsen This author has not yet filled in any details. So far Sara Madsen has created 4 blog entries. Water Infrastructure Public Tours Are Back – Register Now! City of Lomita To Update Street Sweeping Schedule and Routes to Better Meet Residents Needs Organics Waste Recycling Requirement Coming to Lomita Residents across California will soon see changes to the [...] Missed out on the 2021 State of the City? Watch the recording now!",
    "depth": 1,
    "scraped_at": "2025-04-03 18:43:09"
  },
  "lomitacity.com_street-sweeping-changes": {
    "url": "https://lomitacity.com/street-sweeping-changes/",
    "title": "City of Lomita To Update Street Sweeping Schedule and Routes to Better Meet Residents Needs - City of Lomita",
    "content": "City of Lomita To Update Street Sweeping Schedule and Routes to Better Meet Residents Needs Sara Madsen 2024-04-16T13:53:05-07:00 The city’s Public Works team manages Lomita’s contract to provide street sweeping services throughout the city and recently solicited proposals for a new contract. The agreement was awarded to Athens Services, the same provider that delivers solid waste hauling services in Lomita. Athens began providing street sweeping services in April 2023. Prior to and in preparation to solicit bids for the new contract for street sweeping services, the City Council undertook a comprehensive review of the street sweeping services provided to the community. As part of that review, the city has included common concerns and questions raised by residents including the following: Conflicts with school zones and pick-up/drop-off times Difficulty and scarcity of available parking during sweeping times Conflicts between sweeping times and trash pick up days and times – i.e. trash bins on the street do not allow for proper sweeping and take up needed parking Inconsistency of sweeping in certain areas of high priority. Among other concerns… To address these concerns, and to better provide services and ensure our sweeping efforts are effective and efficient, and to reduce the impacts on our residents related to parking as much as possible, the city proposed amendments to the street sweeping routes, frequency, parking restrictions, and overarching services provided. During the July 5, 2022 City Council meeting the amendments detailed below were approved. Currently with the provision of having sweeping and solid waste services by the same provider presents opportunities to align the routes and schedules for these two important services to minimize conflicts and better meet the needs of our residents. The city’s team will be working with Athens over the coming months to review all the input received from our residents regarding route adjustments and will be making recommendations to the City Council for possible amendments to the July 5, 2022 approved maps. The sweeping and trash collection dates, times, and routes will remain unchanged in the interim. Please continue to observe the posted weekly two-hour parking restriction for street sweeping. Maps approved 7/5/22. Adjustments have NOT been implemented and subject to change. View Approved Street Sweeping Maps and Schedule Background on Current Sweeping Program Currently, to meet State and federal sweeping requirements, street sweeping (and the associated parking restrictions to allow for proper sweeping) is performed on a weekly basis in all areas that are regularly swept, but not all streets are included in the existing sweeping routes.  Additionally, some streets may be posted with “No Parking” restrictions during the planned sweeping hours, while others have no restrictions. To address this disparity, and maintain compliance with the City’s requirements, the City is proposing an alternative approach under which the frequency of sweeping is determined based on the actual debris generated on a particular street (see Priority levels, A, B or C below).  This revised structure will allow many of the City’s street sections (and the associated parking restrictions) to be reduced from four or five times per month (weekly) requirements to twice per month, and allow for alternating schedules (i.e. one side of a street one week, and the other side the next) to further improve parking availability. Level Condition Sweeping A Highest volume of trash debris generated At least 2x per month B Moderate volumes of debris At least 1x per month C Low volumes of debris At least 2x per year The revised routes will also allow for reduced conflicts with trash service and with school zones which will free up even more parking for residents to use and will allow for better and more timely enforcement by the city’s parking enforcement teams when necessary to avoid delays between the sweeper and the enforcement vehicle. Implementation and Adjustment Once ready to proceed, new street signs will begin to be replaced and residents will receive notification of any changes that may occur on their streets.  The city will also allow time for residents to adjust to the new routes and schedules by providing a grace period for street sweeping related citations after new signs are in place and providing warnings and notifications in lieu of citations during that period. For questions or comments or to discuss the proposed improvements to the city’s sweeping services, please contact the Public Works Department at (310) 325-7110 ext. 155, or by email at Publicworks@lomitacity.com Public Comment If you would like to provide feedback to the city about this topic, you may do so below.",
    "depth": 2,
    "scraped_at": "2025-04-03 18:43:17"
  },
  "lomitacity.com_wp-content_uploads_2023_05_Approved-Maps-20220705.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/05/Approved-Maps-20220705.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/05/Approved-Maps-20220705.pdf",
    "content": "",
    "depth": 3,
    "scraped_at": "2025-04-03 18:43:20"
  },
  "lomitacity.com_contact": {
    "url": "https://lomitacity.com/contact/",
    "title": "Contact Us - City of Lomita",
    "content": "Contact Us cityoflomita 2023-04-11T17:46:26-07:00 Name (Required) First Last Email (Required) Message CAPTCHA Phone This field is for validation purposes and should be left unchanged. Δ View Staff Directory Phone: (310) 325-7110 City Hall Hours: Monday-Thursday: 7:30 a.m. – 5:30 p.m. Every other Friday: 8:00 a.m. – 5:00 p.m. 2023 City Hall Calendar",
    "depth": 3,
    "scraped_at": "2025-04-03 18:43:39"
  },
  "lomitacity.com_author_cityoflomita": {
    "url": "https://lomitacity.com/author/cityoflomita/",
    "title": "cityoflomita - City of Lomita",
    "content": "About cityoflomita This author has not yet filled in any details. So far cityoflomita has created 0 blog entries.",
    "depth": 4,
    "scraped_at": "2025-04-03 18:43:45"
  },
  "lomitacity.com_directory": {
    "url": "https://lomitacity.com/directory/",
    "title": "City Staff Directory - City of Lomita",
    "content": "City Staff Directory Sara Madsen 2025-01-07T09:57:08-08:00 City Hall Main Line: 310-325-7110 General Administration Extension Business License x137 Water Utility Billing x139 Council & Commission Information x113 Dial-A-Ride x102 Election Information x113 Parking Citations x217 Public Works Extension Permit Submittals x114 Sidewalk, Curb Repairs, Street & Tree Maintenance x155 Water Maintenance x155 Traffic-related Concerns x155 Information about Electrical Outages Report a Streetlight Out (SCE) 800-618-7575 After hours Water Emergency 310-597-6428 After hours Street/Tree/Park Emergency 310-597-6429 Community Development Extension Code Enforcement/Graffiti x156 HUD & CDBG Programs x107 Planning Division x120 Recreation and Facilities Extension Adult League Programs 310-326-0140 Registration & Programs 310-326-0140 Administrative Department (Finance) Extension Accounts Payable x152 Human Resources x144 Phone Directory by Department City Manager’s Department – (City Clerk, Administration, Dial-A-Ride, Housing, CDBG, and Parking Citations and Utility Billing) Name Title Phone Andrew Vialpando City Manager 310-325-7110 Vacant Assistant City Manager 310-325-7110 x121 Lina Hernandez Deputy City Manager/Public Works Director 310-325-7110 x151 Kathleen Horn Gregory City Clerk 310-325-7110 x113 Juan Ibarra Senior Management Analyst 310-325-7110 x124 John Campos Parking Enforcement Supervisor 310-325-7110 x217 Linda Abbott Deputy City Clerk 310-325-7110 x141 Montserrate Gastelum Administrative Analyst 310-325-7110 x107 JP Adamzadeh Management Assistant 310-325-7110 x112 Lety Paz Administrative Assistant 310-325-7110 x102 Parks and Recreation Division – Recreation, Adult and Youth League Programs, Facilities Building and Grounds Maintenance, Railroad Museum and Special Events Name Title Phone Emma Kelley Parks & Recreation Director 310-326-0140 Sean Ritchie Recreation Supervisor 310-326-0140 Cece Villa Administrative Assistant 310-326-0140 Robert Heaney Recreation Coordinator 310-326-0140 Ross Lopez Lead Worker – Facilities 310-326-0140 Pio Nunez Maintenance Worker II 310-326-0140 Brandon Huntelman Maintenance Worker I 310-326-0140 Administrative Services Department – Budget, Accounts Payable, Business License, Water Billing, Human Resources Name Title Phone Susan Kamada Administrative Services Director 310-325-7110 x127 Erika Reyes Senior Accountant 310-325-7110 x129 Rheziel Dacumos Payroll Accountant 310-325-7110 Jessica Luy Accounting Technician 310-325-7110 x152 Martha Harris Accounting Assistant (Water Utility Billing) 310-325-7110 x139 Maria Matesic Accounting Assistant (Business License) 310-325-7110 x137 Deborah Dixon Human Resources Manager 310-325-7110 x144 Dacia Bello Human Resources Intern 310-325-7110 x105 Community Development Department – Planning, Code Enforcement and Economic Development, Film Permits and Animal Control Name Title Phone Adrian Fernandez Community and Economic Development Director 310-325-7110 x122 Bryan Martinez Associate Planner 310-325-7110 x120 Erika Barbero Assistant Planner 310-325-7110 x103 Will Lawson Code Enforcement Supervisor 310-325-7110 x118 Zaynab Qazi Code Enforcement Officer I 310-325-7110 x156 Cherish Hollomon Planning Intern 310-325-7110 x150 Jose Valencia Planning Intern 310-325-7110 x150 Public Works Department – Parks, Sidewalk, Street, Tree & Water Maintenance Name Title Phone Lina Hernandez Deputy City Manager/Public Works Director 310-325-7110 x151 Vacant Principal Engineer 310-325-7110 x110 Joe Vida Management Analyst 310-325-7110 x214 Rachel Bucklew Water Quality and Environmental Specialist 310-325-7110 x155 Jennifer Howell Associate Engineer 310-325-7110 x170 Cory Zedler Engineering Technician 310-325-7110 x111 Noah Crespo Engineering Intern 310-325-7110 x117 Hector Flores Public Works Operations Manager 310-325-7110 x314 Rafael Mendoza Lead Worker – Parks Julio Garcia Maintenance Worker II – Parks William Ibarra Maintenance Worker II – Parks Gabriel Maldonado Maintenance Worker I – Parks Luis Pelayo Maintenance Worker I – Parks Oscar Caviedes Maintenance Aide – Parks Vacant Maintenance Aide – Parks Carlos Bobadilla Lead Worker – Street/Trees Jorge Calderon Maintenance Worker II – Streets Steven Hernandez Maintenance Worker II – Street/Trees Emmanuel Spindola Maintenance Worker I – Street/Trees Chris Moya Maintenance Worker I – Street/Trees Vacant Maintenance Aide – Street/Trees Van Mesa Water Systems Superintendent 310-325-7110 x310 John Williams Treatment Plant Operator Octavio Becerra Treatment Plant Operator David Huerta Water Services Tech II Justin Nguyen Lead Worker – Water Distribution Michael Stoltz Water Services Tech II Cristian Centez Water Services Tech I",
    "depth": 4,
    "scraped_at": "2025-04-03 18:43:50"
  },
  "lomitacity.com_public-works": {
    "url": "https://lomitacity.com/public-works/",
    "title": "Public Works - City of Lomita",
    "content": "Public Works Melanie Moore 2024-06-17T16:05:09-07:00 The Public Works Department has responsibility for the public right of way, public infrastructure, and projects to construct and improve existing infrastructure. Key responsibilities: Water Treatment and Distribution Maintaining City Streets and Trees Maintaining Outdoor areas of City Parks Implementing Capital Improvement Projects Issuing Public Works Permits for work in the City’s right of way Contracting services for traffic signal maintenance, street light maintenance, sewer maintenance, street sweeping, traffic engineering, Industrial Waste Discharge program Public Works Permit Application Master Fee Schedule Capital Improvement Program Water Operations and Maintenance Urban Water Management Plan Stormwater Pollution Prevention Street Maintenance Tree Maintenance Traffic Water Meter Shutoff Contact Us Call us: 310-325-7110 x155 Email us Our Location 24300 Narbonne Ave. Lomita, CA U.S.A. 90717 Department Head Lina Hernandez Interim Public Works Director Bio",
    "depth": 5,
    "scraped_at": "2025-04-03 18:43:56"
  },
  "lomitacity.com_wp-content_uploads_2022_10_City-Hall-2023-yearly-calendar-with-Council-Date.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2022/10/City-Hall-2023-yearly-calendar-with-Council-Date.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2022/10/City-Hall-2023-yearly-calendar-with-Council-Date.pdf",
    "content": "",
    "depth": 4,
    "scraped_at": "2025-04-03 18:43:59"
  },
  "lomitacity.com_organics-waste-recycling-requirement-coming-to-lomita": {
    "url": "https://lomitacity.com/organics-waste-recycling-requirement-coming-to-lomita/",
    "title": "Organics Waste Recycling Requirement Coming to Lomita - City of Lomita",
    "content": "Organics Waste Recycling Requirement Coming to Lomita Residents across California will soon see changes to the way organic waste is disposed of and recycled. Signed into law in 2016, California Senate Bill 1383 (SB 1383) established a statewide goal to reduce the amount of organic waste disposed of in landfills by 75%. The bill also set a goal to recover at least 20% of edible food waste by 2025. Research has shown that greenhouse gases released by human activities, such as landfilling organics, like food and yard waste, contribute to climate change. To respond to the climate crisis, the state is requiring all California cities, including Lomita, to reduce organic material waste and rescue surplus food to feed Californians facing food insecurity starting on January 1, 2022. Organic waste includes the following materials: food waste, green waste, landscape and pruning waste, non-hazardous wood waste, and food-soiled paper waste that is mixed in with food waste. Separating out these materials from regular trash, similar to separating recyclable materials, allows the City’s waste hauler, Athens Services, to repurpose these materials into value-add products like mulch, compost, healthy soil and other materials that help our environment as opposed to harm it. Effective January 1, 2022, all single-family residential, multi-family residential and businesses will be required to participate in organic recycling. The City of Lomita, together with Athens Services, will launch a new Organics Recycling Program to help everyone navigate the requirements for this state-mandated measure, and to educate residents on the proper way to sort organic waste at home. The Organics Recycling Program will: Ask residents to dispose of their organic material in their existing green waste bin Create opportunities for businesses, grocery stores and large restaurants to donate edible food to food banks for those in need Reserve California’s valuable landfill space for only products that cannot be recycled Reduce greenhouse gas emissions The City of Lomita will provide extensive education to residents in the weeks and months ahead. Be on the lookout for important materials that come through your mailbox and inbox and visit our website for updates: LomitaCity.com/SB1383/ Starting on January 1, 2024 all residents and businesses in California including Lomita will be required to recycle their organic waste. Organic waste includes food scraps, food-soiled paper and green waste. For more information on how this regulation will affect solid waste management, visit CalRecycle’s Organics homepage at CalRecycle.ca.gov/nav/organics . Sara Madsen 2023-09-14T15:25:34-07:00",
    "depth": 2,
    "scraped_at": "2025-04-03 18:44:04"
  },
  "lomitacity.com_sb1383": {
    "url": "https://lomitacity.com/sb1383/",
    "title": "Organics Recycling is Changing in Lomita! - City of Lomita",
    "content": "Organics Recycling is Changing in Lomita! Sara Madsen 2024-04-15T12:23:30-07:00 Residents across California will soon see changes to the way organic materials, such as food scraps and yard trimmings, are disposed of and recycled. SB 1383, a statewide effort to reduce emissions of greenhouse gases, will require all California cities, including Lomita, to reduce organic waste and recover surplus food to feed Californians facing food insecurity. This means there will be some changes in how we ask our residents to sort their organic waste, and in how our City’s waste hauler, Athens Services, collects and processes organic materials. During this period of transition, we appreciate our community’s cooperation and dedication to our City’s goal of creating a more sustainable future for generations to come. Starting on January 1, 2024 all residents and businesses in California including Lomita will be required to recycle their organic waste. Organic waste includes food scraps, food-soiled paper and green waste. What does this mean for you? The City of Lomita is partnering with our waste hauler, Athens Services, which will provide safe and reliable curbside collection services for residents and businesses, including you! For residents, you will simply dispose of your organic waste in your existing green waste bin. Help Be the Change! When organic materials such as food scraps, yard trimmings, and paper break down in a landfill, they contribute to climate change. Because these materials decompose anaerobically (without oxygen) in a landfill, they produce methane, which is one of the most potent greenhouse gases in the atmosphere and a major contributor to climate change. In an effort to protect the environment and reduce methane emissions, the State is requiring cities, like Lomita, to increase the diversion of organic materials away from landfills and toward the production of value-added products such as fertilizers, compost, and biofuels. The simplest way to accomplish this is to separate out organic waste from the rest of our trash, the same way we do with recyclable materials. This allows our waste hauler to repurpose these materials into mulch, compost, healthy soil, and other materials that help, not harm, our environment. One of the most powerful things you can do to help California adapt to a changing climate is to use compost and mulch produced in California to sequester, or reuse, carbon in the soil – giving your organic waste a second life and purpose. For tips on composting and other helpful gardening information, visit: https://dpw.lacounty.gov/epd/sg/ Access the AB 341 and SB 1383 Waiver Request Form Frequently Asked Questions What is organic waste? Sara Madsen 2021-11-09T23:35:57-08:00 What is organic waste? Organic waste is any material that is biodegradable and comes from either a plant or an animal. Biodegradable waste is organic material that can be broken into carbon dioxide, methane, or simple organic molecules. What items are considered organic waste and acceptable for the green waste bin? Sara Madsen 2022-12-17T00:23:10-08:00 What items are considered organic waste and acceptable for the green waste bin? Green Waste Grass clippings Leaves and branches Flower and hedge trimmings Weeds Lumber, scrap wood and plywood (not painted or treated) Food Scraps Fruits and vegetables Cheese and dairy Meat, bones, poultry and seafood (including soft shells) Bread, rice and pasta Cut flowers and herbs Coffee grounds and filters Any putrescible matter produced from human or animal food production, preparation, and consumption activities Food-Soiled Paper Food-stained paper Napkins and paper kitchen towels Paper egg cartons Paper food boats (no plastic lining) Paper packaging Paper plates and cups (no plastic lining) Pizza boxes 100% fiber based, compostable serving-ware and to-go containers Plates Plastic and bioplastic bags are accepted in the green waste bin but must be clear or translucent-green, and bag contents must be visible. Why are the requirements changing? Sara Madsen 2021-11-09T23:37:52-08:00 Why are the requirements changing? A focus on recycling organic materials is central to California’s efforts to combat climate change. California has been experiencing the effects of a climate crisis: hotter summers, extreme temperatures, an increase in wildfires, extreme droughts, and rising sea levels that erode our coastlines. Research has taught us that greenhouse gases released by human activities, such as landfilling food and yard waste, contribute to climate change. To respond to this climate crisis, California is implementing statewide organic waste recycling and surplus food recovery. Who do these new requirements apply to? Sara Madsen 2021-11-09T23:38:18-08:00 Who do these new requirements apply to? Everybody, including you! If you live, work, or own property in the State of California, you will need to take part in these new processes. How do I participate? Sara Madsen 2021-11-09T23:41:12-08:00 How do I participate? Residents What are my responsibilities as a resident? Residents will simply dispose of organic/compostable waste in your existing green waste bin. Investing in a kitchen trash bin used specifically for organics is recommended and will make this process easy. Businesses What are my responsibilities as a business? Any business with 2 cubic yards of trash or more weekly is required to recycle organics and food waste. Food service businesses must donate edible food to food recovery organizations with others starting in 2024. This will help feed the almost 1 in 4 Californians without enough to eat. California has a goal to redirect 20% of edible food currently thrown away to people in need by 2025. Self-Haulers (contractors, construction workers, landscapers, etc.) What are my responsibilities as a self-hauler? Self-haulers will need to ensure all organic compostable materials — such as hedge and tree trimmings, cardboards, wood scraps, etc. — are separated from landfill materials and properly disposed of. Where will organic waste go? Sara Madsen 2021-11-09T23:41:42-08:00 Where will organic waste go? As California collects and recycles organic materials, local governments will be required to use the products made from this recycled organic material, such as renewable energy, compost, and mulch. For example, organic waste will be used to curate healthy soil! Compost is a key to healthy soil, and healthy soil is critical to reducing carbon in the air. Where will recovered surplus edible food go? Sara Madsen 2022-03-10T20:34:23-08:00 Where will recovered surplus edible food go? Recovered surplus edible food will be donated to food banks, homeless shelters, and other organizations for those who are food insecure. Starting in 2022, food service businesses must donate edible food to food recovery organizations. This will help feed the almost 1 in 4 Californians without enough to eat. California has a 2025 goal to redirect to people in need 20% of edible food currently thrown away. Am I required to participate? What if I don’t change anything about how I take out my trash? Sara Madsen 2021-11-09T23:43:04-08:00 Am I required to participate? What if I don’t change anything about how I take out my trash? Yes! This is a new system similar to how your trash is picked up now. Everyone will need to participate and properly sort discarded materials into the correct bins or receptacles provided. If you choose not to participate, you may receive a fine similar to if you don’t dispose of your regular trash properly. The enforcement provisions in SB 1383 will assist jurisdictions, non-local entities, local education districts, state, federal facilities, and CalRecycle to achieve the state’s climate goals and the 75 percent organic waste diversion goal by 2025 and into the future. More information on enforcement rollout are forthcoming. What if I don’t have the right resources? Sara Madsen 2021-11-09T23:43:40-08:00 What if I don’t have the right resources? The City of Lomita will provide resources to all residents and businesses. Starting in 2022, all jurisdictions will need to provide organic waste collection services to all residents and businesses and facilitate the recycling of these organic materials through their hauler. Will this mandate be enforced? Sara Madsen 2021-11-09T23:44:16-08:00 Will this mandate be enforced? The enforcement provisions in SB 1383 will assist jurisdictions, non-local entities, local education districts, state, federal facilities, and CalRecycle to achieve the state’s climate goals and the 75 percent organic waste diversion goal by 2025 and into the future. More information on enforcement rollout is forthcoming. What items should not be included in the green waste bin? Kayla Cao 2022-12-17T00:24:12-08:00 What items should not be included in the green waste bin? Please do not include the following: All plastics Cacti, succulents and yucca Compostable plastics (bioplastics) Coffee cups and pods Fats, oils and grease Food stickers (please remove) Gloves Hard shells (clams, mussels, oysters) Medication Palm fronds Paper napkins and towels with cleaning chemicals Parchment and wax paper Pet waste Rocks and soil Rubber bands and twist ties Tea bags Textiles Tissues and wet wipes Edible Food Recovery Resources Directories Los Angeles County Food DROP Program The Food DROP Program provides an interactive map that lists the contact information for food recovery and food rescue organizations within LA County. LACounty.gov Food Pantries The Food DROP Program provides an interactive map that lists the contact information for food recovery and food rescue organizations within LA County. FoodPantries.org App Careit Careit is a free online donation matching marketplace for edible food generators and food recovery organizations to responsibly donate their surplus food and resources. Careit enables businesses, governments, and food recovery organizations to maintain uniform food donation records. CareitApp.com Funded by a grant from CalRecycle",
    "depth": 3,
    "scraped_at": "2025-04-03 18:44:10"
  },
  "lomitacity.com_wp-content_uploads_2023_10_Waiver-Request-AB-341-SB-1383-Athens-Services-West-2023.pd": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/10/Waiver-Request-AB-341-SB-1383-Athens-Services-West-2023.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/10/Waiver-Request-AB-341-SB-1383-Athens-Services-West-2023.pdf",
    "content": "",
    "depth": 4,
    "scraped_at": "2025-04-03 18:44:14"
  },
  "lomitacity.com_author_tsakayla": {
    "url": "https://lomitacity.com/author/tsakayla/",
    "title": "Kayla Cao - City of Lomita",
    "content": "About Kayla Cao This author has not yet filled in any details. So far Kayla Cao has created 0 blog entries.",
    "depth": 4,
    "scraped_at": "2025-04-03 18:44:18"
  },
  "lomitacity.com_about": {
    "url": "https://lomitacity.com/about/",
    "title": "About Lomita - City of Lomita",
    "content": "About Lomita Melanie James 2024-02-02T11:49:01-08:00 Welcome to the City of Lomita website. The purpose of this website is to connect Lomita residents and others interested in the City of Lomita with information on City services, government activities and City programs and events. City Hall is open to the Monday through Thursday from 7:30 a.m. – 5:30 p.m. and every other Friday from 8:00 a.m. to 5:00 p.m 2024 City Calendar Mission, Vision and Core Values On March 18, 2013, the Lomita City Council adopted Resolution No. 2013-13, establishing Vision, Mission and Core Values Statements to provide a more productive workforce, better customer service, and quality of life to the citizens of Lomita. These were revised in September 2014 and are listed below: Mission The mission of the City of Lomita is to provide a healthy, safe and friendly small-town community where everyone can successfully live, work and play. Vision As a family friendly City, Lomita will strive creatively and consistently to provide excellent public service and employee performance, with the intent to enrich the quality of life for every citizen, worker and business owner. Core Values Professionalism/Integrity – The City will operate with utmost integrity including treating all residents, customers, and other members of the public with respect and professionalism. Respect – Respect of others is a fundamental requirement for operating a professional organization. The City will respect residents, business owners, customers, each other, the environment, and institutions. Innovation/High Performance – The City will consistently strive for continuous quality improvement in everything it does. This includes creative thinking and finding innovative and cost-effective ways to accomplish the City’s goals in a fiscally prudent manner. Health and Safety Awareness – The City will consistently strive to maintain public safety and health and to provide recreational opportunities by upholding established rules and regulations to promote community wellness in order to sustain a healthy environment.",
    "depth": 1,
    "scraped_at": "2025-04-03 18:44:23"
  },
  "lomitacity.com_author_tsamelanie": {
    "url": "https://lomitacity.com/author/tsamelanie/",
    "title": "Melanie James - City of Lomita",
    "content": "About Melanie James This author has not yet filled in any details. So far Melanie James has created 4 blog entries. Information on Mosquito Abatement/Prevention Safety & Housing Element Information Helping Community Members in Need Promoting Home Share South Bay in Lomita! Homeowners - Be Part of the Solution Are [...]",
    "depth": 2,
    "scraped_at": "2025-04-03 18:44:28"
  },
  "lomitacity.com_wp-content_uploads_2021_10_Mosquitoes-Other-Insects-and-Vectors-4-19.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/Mosquitoes-Other-Insects-and-Vectors-4-19.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/Mosquitoes-Other-Insects-and-Vectors-4-19.pdf",
    "content": "",
    "depth": 3,
    "scraped_at": "2025-04-03 18:44:31"
  },
  "lomitacity.com_general-plan": {
    "url": "https://lomitacity.com/general-plan/",
    "title": "General Plan - City of Lomita",
    "content": "General Plan Sara Madsen 2025-03-18T21:02:19-07:00 Quick Links General Plan Update Website General Plan 2021-2029 Housing Element Safety Element A general plan serves as a “blueprint” for the future development of a city. It establishes land use designations and policies to assist decision-makers as they review proposals for new development or consider changes to city ordinances. The general plan addresses issues that impact the entire city, such as how land is used, where buildings are built, the locations of roads and parks, safety, noise and more. The City last comprehensively updated its general plan in 1998 and since that time, Lomita has experienced significant changes across the city. The proposed changes are partially the result of the implementation of State requirements relative to the recently certified Housing Element to accommodate additional housing options in the City, and partially the result of the City’s decision to activate the commercial corridors to revitalize the areas through redevelopment and the addition of active and vibrant uses along Pacific Coast Highway, Lomita Boulevard and Narbonne Avenue. Channeling the State-mandated density onto Lomita’s commercial corridors follows development patterns, provides for efficient mobility and protects the longstanding lower-density residential neighborhoods adjacent to commercial corridors.",
    "depth": 3,
    "scraped_at": "2025-04-03 18:44:36"
  },
  "lomitacity.com_wp-content_uploads_2025_01_General-Plan-2024_final.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2025/01/General-Plan-2024_final.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2025/01/General-Plan-2024_final.pdf",
    "content": "",
    "depth": 4,
    "scraped_at": "2025-04-03 18:44:39"
  },
  "lomitacity.com_wp-content_uploads_2023_09_Lomita-Housing-Element-Final-Certified-2022.10.14-PDF-1.pd": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/09/Lomita-Housing-Element-Final-Certified-2022.10.14-PDF-1.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/09/Lomita-Housing-Element-Final-Certified-2022.10.14-PDF-1.pdf",
    "content": "",
    "depth": 4,
    "scraped_at": "2025-04-03 18:44:42"
  },
  "lomitacity.com_wp-content_uploads_2022_05_Lomita-Safety-Element-Final-Adopted.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2022/05/Lomita-Safety-Element-Final-Adopted.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2022/05/Lomita-Safety-Element-Final-Adopted.pdf",
    "content": "",
    "depth": 4,
    "scraped_at": "2025-04-03 18:44:47"
  },
  "lomitacity.com_covid-19": {
    "url": "https://lomitacity.com/covid-19/",
    "title": "Page not found – City of Lomita",
    "content": "Oops, This Page Could Not Be Found! 404 Helpful Links About Lomita Mission, Vision, & Core Values History Census Information City Maps Government City Council Agendas & Minutes Public Notices Meeting and Special Events Calendar Boards & Commissions Agendas & Minutes Meeting and Special Events Calendar Housing Authority Planning Commission Parks and Recreation Commission Public Safety and Traffic Commission State & Regional Elected Officials Municipal Code City Departments Administrative Services Budgets Business Licensing Finance City Organizational Chart Utility Billing City Manager Human Resources Filming Permits Recycling & Waste Collection Organic Waste Recycling Community Survey Results Community & Economic Development General Plan Building & Safety Code Enforcement Graffiti Planning Division Online Permitting Housing Resources City Attorney City Clerk Elections & Voter Information Agendas & Minutes City Council Boards & Commissions State & Regional Elected Officials Ethics Regulations Municipal Code Public Notices Public Records Requests Current Bids & RFPs Districting Resources Public Works Capital Improvement Projects Water Operations & Maintenance Water Meter Shutoff Urban Water Management Plan Roadwork Stormwater Management Street Maintenance Traffic Trash Collection and Street Sweeping Tree Maintenance Public Safety LA County Sheriff's Department LA County Fire Department Parking Enforcement Pet Ownership Animal Care and Control Neighborhood Watch Program Crime Statistics Emergency Preparedness Community Emergency Response Team (CERT) Automated License Plate Recognition Privacy Policy Recreation and Facilities Adult Sports Leagues Youth Sports Leagues Register for Recreation Classes Senior Programs Teen Program Lomita Railroad Museum List of Recreation Facilities City Staff Directory Community City Parks & Gardens Map of City Parks Lomita Public Library Friends of the Lomita Library Lomita Railroad Museum Lomita Historical Society Resources for Unhoused Persons Lomita Sister City School Sites and Information Dial-A-Taxi Program Dial-A-Ride Program Latest City News City e-Newsletter City Quarterly Newsletter Lomita Merchandise City Council District Information Business Building & Safety Business Directory Business Licensing Current Bids & RFPs Lomita Chamber of Commerce Planning Division Citywide Master Fee Schedule I Want To... Apply for an Online Permit Contact the City Pay a Parking Citation Pay My Water Bill Report a Code Violation or Graffiti Report a Street Light Outage Report an Electrical Outage Submit a Service Request Start Water Service Sign Up for Dial-A-Ride Apply for a Public Works Permit Rent a Facility Apply to be a Vendor Apply to Volunteer Submit a Public Records Act Request Search Our Website Can't find what you need? Take a moment and do a search below! Search for:",
    "depth": 3,
    "scraped_at": "2025-04-03 18:44:53"
  },
  "lomitacity.com_history": {
    "url": "https://lomitacity.com/history/",
    "title": "History - City of Lomita",
    "content": "History Melanie James 2021-12-08T23:10:42-08:00 The following history of Lomita was written by Lomita resident, Brian C. Keith. Early History of Lomita The earliest known inhabitants of Southern California probably arrived before 9000BC, based on radiocarbon dates of artifacts found on the Channel Islands. Evidence of the earliest known indigenous inhabitants of Lomita and environs, the Gabrielino Indians, has been found in a village they called Suangna, or “Place of the Rushes”, near what is now the intersection of 230th Street and Utility Way in Carson. Remnants of this village remained even as late as the 1850s. Lomita’s part in the Spanish period of California’s history begins in 1542, when Juan Rodriguez Cabrillo sailed into Bahia de los Humos, or Bay of Smoke as he called it, followed by Sebastian Viscaino in 1603, who renamed it San Pedro Harbor, after Saint Peter. Things remained relatively quiet until 1784, when a Spanish soldier named Juan Jose Dominguez, a member of the Portola Expedition, requested and received permission to use 75,000 acres of land in Southern California from Don Pedro Fages, the Spanish Governor of California. Rancho San Pedro, the first land grant to be bestowed in California by King Charles III of Spain, stretched from the Los Angeles river to the Pacific Ocean and included what would become the cities of Carson, Torrance, Redondo Beach, Lomita, Wilmington, and parts of San Pedro. At about the same time, the Sepulvedas established and started raising cattle on Rancho Los Palos Verdes, which caused quite a stir with the Dominguez family, as the Sepulvedas hadn’t actually received a land grant. They quarreled often, part of present day Lomita laying at the boundary of their dispute, which they didn’t resolve until 1841, when the Sepulvedas finally acquired and signed a deed. The rancheros flourished until the 1860s, when a series of natural disasters hit Southern California: Too much rain in 1861 Too little in 1862 A paralyzing smallpox epidemic in 1862 The ravaging of grazing lands by swarms of grasshoppers in 1863 No rain in 1864 The utter destruction of the region’s cattle herds by 1865 The rancheros foundered. Due to delinquent taxes and mortgage foreclosures, Rancho Los Palos Verdes was divided up and sold to 17 different buyers in 1882. Most of the land that constitutes present day Lomita was sold to a farmer named Ben Weston and the Ranch Water Company, which sheep farmer Nathaniel Andrew Narbonne, who was born in Salem, Massachusetts, owned. Narbonne received 3,500 acres. Narbonne had moved to Lomita from Sacramento’s gold rush country in 1852. He had initially worked with General Phineas Banning in Wilmington and later, with partner Ben Weston, grew wheat and raised sheep on Santa Catalina Island. Municipal History of Lomita Credit: Lomita Historical Society Photo Although there’s no question that Lomita derives its name from the Spanish for “little hills,” there is apparently some disagreement over just who originally bestowed the name. One source claims Lomita was named by the early promoters of the district as they surveyed it from a hillside in Rancho Palos Verdes. Another source claims that “Lomita del Toro”, or “little hills of the bull,” appears on an early surveyor’s map of Rancho San Pedro, just a few miles east of the present day city, implying that Lomita inherited its name from the local fauna. In any case, probably the biggest event in Lomita’s early municipal history occurred in 1907, when the W. I. Hollingsworth Company purchased a large tract of land just north of the Palos Verdes hills. The company intended to make the seven square mile subdivision a Dunkard colony after several of its clients, who were Dunkards, had expressed an interest in founding a settlement in the Los Angeles area. Development began soon afterwards. J. H. Pickering, a grading contractor, was hired to plow the roads and A. L. McSwain, a well driller, was hired to sink four water wells. Both men ended up living on the land they helped develop. Other notable early settlers of Lomita include farmer M. M. Eshelman, considered by his peers to be the pioneer of the colony, and J. A. Smith, a miner and budding realtor (shown at left) who, in 1909, bought up 160 acres of land in Lomita and sold it for a nice profit to all of his Arizona mining buddies. A school, general store (including a post office), and other businesses quickly followed. In 1909, the first churches in Lomita were built. In 1921, heirs of Nathaniel Narbonne donated a parcel of property to Los Angeles on which to build a school to be named after their ancestor, which is today Fleming Middle School at 25425 Walnut Street. In 1958, Narbonne High School moved from Walnut Street to 24300 South Western Avenue in Harbor City. Credit: Lomita Historical Society Photo Just as Lomita has its share of players and pioneers, so it has its share of stories too. In a scene reminiscent of the movie “The Two Jakes,” the water pump attached to the first well A. L. McSwain sank kept failing sporadically. C. B. Hollingsworth and H. E. Covert, Hollingsworth’s sales agents for Lomita, were called out to determine why. Covert took a seat near the water discharge pipe, musing. He lit a cigar and tossed the lit match near the pipe, which exploded in his face, nearly knocking him over. Little did he and the company realize at the time that that pocket of natural gas augured an oil boom that would change the face of Lomita forever. Not that they weren’t given a few bizarre hints along the way. Mrs. Carvill, a local Spiritualist dubiously associated with the company’s principal, confided to him more than once that she had had visions of a “very black substance underneath the ground” on which McSwain was sinking the wells, and was worried that it might contaminate the water. Notwithstanding premonitory explosions and Spiritualist visions, however, it took Hollingsworth and company sixteen years to figure it out. And even then they weren’t the discoverers. That distinction goes to a local character named “Tuck” Eaton. In 1923, Eaton sank a couple test oil wells on local land owned by Albert G. Sepulveda. And proceeded to strike it rich. Credit: Lomita Historical Society Photo Property values skyrocketed. Lots that had originally been purchased for $300 to $400 sold for as much as $35,000. McSwain sold the ten acres he’d received for his services sixteen years earlier to the Los Angeles Board of Education for $80,000. When all was said and done, about 500 acres of the original tract of Lomita was given over to the oil industry. And never a dry hole was sunk. Modern History of Lomita Credit: Lomita Historical Society Photo As Lomita emerged from the boom and bust of the 1920s and crept slowly into the 1930s, it soon acquired a new reputation as “Celery Capital of the World” (although some claim it could just as easily have acquired the title “Strawberry Capital of the World” as well). Truck farming of vegetables, fruits, and eggs became the prevailing occupation of Lomita residents in the 1930s. In early 1935, a vaudevillian named Frank A. Gumm of Grand Rapids, Minnesota leased the Lomita Theater, which was located on Narbonne Avenue near 243rd Street, to present his singing and dancing daughters Mary Jane, Dorothy Virginia, and Judy, who would later change her name to Judy Garland. Credit: Lomita Historical Society Photo Other than its involvement in World War II, Lomita remained relatively quiet during the early 1940s. That quiet was disturbed in January 1944, however, when Army Air Corps pilot Merl Ogden, returning from a test flight of his Lockheed P-38 Lightning to the Lomita Flight Strip, now known as Zamperini Field, Torrance Municipal Airport, discovered that he couldn’t lower his landing gear. He subsequently ran out of fuel and crashed into Lomita’s Victory Garden. He died instantly. After World War II, Lomita’s population exploded. As the 1950s progressed, adjacent cities, including the cities of Torrance and Rolling Hills, attempted to annex major portions of the original subdivision, Torrance succeeding. Credit: Lomita Historical Society Photo The Hot ‘n’ Tot, 1951 By the early 1960s, only 1.87 square miles of the original 7 square mile subdivision remained. And Torrance wanted more. On June 30, 1964, after a couple of unsuccessful attempts, Lomita was incorporated as a city. In addition to halting annexation, incorporating was intended to curtail the development and construction of highrise apartments, a serious concern at the time. As one long time resident put it, “there was a definite feeling that this should be kept a small town and not just a subsidiary for a big city. Most of the people who came here have in mind family situations. If they come here, they don’t want a lot of swingers in apartments.” The 70s and 80s passed without much incident. In 1989, 1993, and again in 1999, Lomita tried unsuccessfully to withdraw from the Los Angeles Unified School District, claiming it wanted more control and better management of its schools’ curriculum and spending. In 1990, the City had better luck with the County of Los Angeles, seceded from the water district, and assumed complete control and operation of Water District 13. Although it’s shrunk from its original 7 square miles to a meager 1.87 square miles, Lomita has managed not only to survive, but to mature. Boundary disputes, land divisions, natural disasters, civil wars, world wars, and cold wars, oil booms, stock market busts, and even annexation to surrounding communities couldn’t consume little Lomita. From a simple ranch house and a few out-buildings on the Narbonne property, a sleepy narrow gauge electric railroad stop on Western Avenue, and a handful of dirt roads named after trees and fruits, Lomita has grown into a small city and, in spite of that growth, managed to maintain its rustic, small-town flavor. San Pedro Trolley Line, Early 1900s Sources: History of the Harbor District of Los Angelesby Ella A. Ludwig, 1927; Lomita: Scenes from a California Town, Financial Federation, Inc., 1978; February 7, 1997 Los Angeles Times article (page B2) by Cecilia Rasmussen; January 1, 2000 Daily Breeze article (page M23) by Carmen Marinella; Lomita Adopted Annual Budget 1998-1999; various web pages",
    "depth": 4,
    "scraped_at": "2025-04-03 18:45:00"
  },
  "lomitacity.com_city-maps": {
    "url": "https://lomitacity.com/city-maps/",
    "title": "City Maps - City of Lomita",
    "content": "City Maps Melanie James 2021-10-12T22:26:47-07:00 Click on any image below to view the full-size PDF map. City of Lomita Street Map City of Lomita Street & Parcel Map City of Lomita General Plan Map City of Lomita Zoning Map City of Lomita Landmark Map",
    "depth": 4,
    "scraped_at": "2025-04-03 18:45:05"
  },
  "lomitacity.com_wp-content_uploads_2021_10_Street_Map_5x8.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/Street_Map_5x8.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/Street_Map_5x8.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:08"
  },
  "lomitacity.com_wp-content_uploads_2021_10_Parcels_8x5.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/Parcels_8x5.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/Parcels_8x5.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:12"
  },
  "lomitacity.com_wp-content_uploads_2021_10_GeneralPlanLtr2018.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/GeneralPlanLtr2018.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/GeneralPlanLtr2018.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:14"
  },
  "lomitacity.com_wp-content_uploads_2021_10_ZoningLtr2018.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/ZoningLtr2018.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/ZoningLtr2018.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:17"
  },
  "lomitacity.com_wp-content_uploads_2021_10_Landmarks.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/Landmarks.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/Landmarks.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:20"
  },
  "lomitacity.com_city-council": {
    "url": "https://lomitacity.com/city-council/",
    "title": "City Council - City of Lomita",
    "content": "City Council Sara Madsen 2025-01-30T19:24:43-08:00 The Lomita City Council is comprised of five members elected at large to four-year terms. Annually, the City Council selects one of its members to serve as Mayor, and one member to serve as Mayor Pro Tem. The City operates under the Council-Manager form of government. The City Council serves as the elected legislative and policy-making body of the City, enacting all laws and directing any actions necessary to provide for the general welfare of the community.  The City Council is assisted by four commissions and a number of subcommittees to advise on matters within specific areas of responsibility.  The City Council appoints the City Manager and City Attorney and members of all advisory Commission, Boards and Subcommittees. Agendas & Minutes Meeting Calendar Public Notices 2024 Legislative Platform Mayor Mark Waronek View Bio Mark A. Waronek Mayor Mayor Pro Tem Cindy Segawa View Bio Cindy Segawa Mayor Pro Tem Councilmember James Gazeley View Bio James Gazeley Councilmember Councilmember Bill Uphoff View Bio Bill Uphoff Councilmember Councilmember Barry M. Waite View Bio Barry Waite Councilmember Core Values, Vision, and Mission Statement The City Council has adopted a set of core values, vision and mission statements for the City, as follows: Core Values Professionalism/Integrity The City will operate with utmost integrity including treating all residents, customers, and other members of the public with respect and professionalism. Respect Respect of others is a fundamental requirement for operating a professional organization. The City will respect residents, business owners, customers, each other, the environment, and institutions. Innovation/High Performance The City will consistently strive for continuous quality improvement in everything it does. This includes creative thinking and finding innovative and cost-effective ways to accomplish the City’s goals in a fiscally prudent manner. Health and Safety Awareness The City will consistently strive to maintain public safety and health and to provide recreational opportunities by upholding established rules and regulations to promote community wellness in order to sustain a healthy environment. Vision Statement As a family friendly City, Lomita will strive creatively and consistently to provide excellent public service and employee performance, with the intent to enrich the quality of life for every citizen, worker and business owner. Mission Statement The mission of the City of Lomita is to provide a healthy, safe and friendly small-town community where everyone can successfully live, work and play. Meeting Information Regular City Council meetings are held on the 1st and 3rd Tuesdays of the month at 6:00 pm. View the meeting calendar. Statement of Economic Interests The City Councilmembers are elected officers identified in Government Code Section 87200 and file statements of economic interests with the City Clerk’s office. Copies of the statements of economic interests filed by these elected officers may be obtained by visiting the offices of the Fair Political Practices Commission (FPPC) or the City Clerk. The physical address of the FPPC is 428 J Street, Suite 620, Sacramento, California 95814. The physical address of the City Clerk’s office is 24300 Narbonne Avenue Lomita CA 90717. The statements of economic interests for some state and local government agency elected officers may be available in electronic format on the FPPC’s website at http://www.fppc.ca.gov . 2024 Notice of Reorganization (PDF) 2023 Notice of Reorganization (PDF) 2022 Notice of Reorganization (PDF)",
    "depth": 4,
    "scraped_at": "2025-04-03 18:45:25"
  },
  "lomitacity.com_agendas-minutes": {
    "url": "https://lomitacity.com/agendas-minutes/#communitydevelopment",
    "title": "Agendas & Minutes - City of Lomita",
    "content": "Agendas & Minutes Kalee Cummings 2025-01-22T10:30:08-08:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Meeting Agendas & Minutes Regular meetings of the City Council are held at 6:00 p.m. on the first and third Tuesdays of each month at City Hall in the council chambers located at 24300 Narbonne Avenue, Lomita, CA 90717. Agendas are made available 72 hours prior to the meeting date. Council and Commission Meeting Calendar Archive of City Council meeting agendas and minutes from 2008-2023 available here . Archived Board & Commission Agendas & Minutes 2019-2024 Archived Planning Commission Agendas To view video recordings of the Planning Commission meetings, click here . Archived Lomita Housing Authority Agendas Archived Lomita Public Safety and Traffic Commission Agendas Archived Parks and Recreation Commission Agendas Archived Community Development Advisory Board Agendas Archived Lomita Public Financing Authority Agendas If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:05"
  },
  "lomitacity.com_meeting-calendar": {
    "url": "https://lomitacity.com/meeting-calendar/",
    "title": "Meeting and Special Events Calendar - City of Lomita",
    "content": "Meeting and Special Events Calendar Sara Madsen 2023-12-20T14:18:34-08:00 View 2024 PDF Calendar",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:44"
  },
  "lomitacity.com_public-notices": {
    "url": "https://lomitacity.com/public-notices/",
    "title": "Public Notices - City of Lomita",
    "content": "Public Notices Sara Madsen 2025-03-24T12:31:55-07:00 Current Public Notices Notice of March 18 Adoption of Urgency Ordinance No. 870U and First Reading of Ordinance No. 871 March 7: Updated Notice of the City of Lomita Parks & Recreation Commission, Planning Commission and Public Safety and Traffic Commission Vacancies Notice of February 18 Adoption of Ordinance No. 869 Public Notice Archive 2025 Notice of Public Hearing for the City Council To Consider Zoning Text Amendment 2025-01 Notice of Public Hearing for the Planning Commission To Consider Zoning Text Amendment 2024-08 and Zoning Text Amendment 2025-02 Notice of Public Hearing for the Community Development Advisory Board to Hold a Public Hearing in the Matter of 2025-26 CDBG Recommended Projects Notice of Adopted Ordinance No. 868, Zoning Text Amendment No. 2024-07 Notice of Public Hearing for the Lomita City Council to Consider Ordinance No. 868, Zoning Text Amendment No. 2024-07 Notice of Public Hearing for the Planning Commission To Consider Conditional Use Permit 330 Notice of the City of Lomita Parks & Recreation Commission Vacancy 2024 Dec. 4, 2024: Updated Notice of the City of Lomita Parks & Recreation Commission, Planning Commission and Public Safety and Traffic Commission Vacancies Notice That the Lomita City Council Adopted Ordinances No. 866 and 867U Notice of Public Hearing for the City Council To Consider Zoning Text Amendment No. 2024-07 Notice of Lomita City Council Public Hearing To Adopt Ordinance No. 864 To Incorporate by Reference the Amended Title 32 of the Los Angeles County Fire Code Notice of Public Hearing for the Planning Commission To Consider Zoning Text Amendment No. 2024-06 and Zoning Text Amendment No. 2024-07 Public Notice: Summary of Adopted Ordinance No. 863 Public Notice of Intention To Amend the Conflict of Interest Code Notice of the City of Lomita Parks & Recreation Commission Vacancy Notice of Election Public Notice: Summary of Proposed Ordinance No. 863 Notice of Public Hearing for the City Council to determine that the requirements of California Government Code 4217.10-4217.18 are duly met in the proposed Design-Build HVAC System Upgrade Project Notice of Public Hearing for the Planning Commission To Consider Determination of Similarity 2024-1 and Minor Conditional Use Permit No. 7 Notice of Public Hearing for the City Council to Update the City of Lomita General Plan Notice of Public Hearing for the Planning Commission To Review the Proposed General Plan, Zoning Ordinance, and California Environmental Quality Act (CEQA) Findings of the Environmental Impact Report Notice of Public Hearing for the Planning Commission To Consider Site Plan Review No. 1219 Notice of Extending Bid Due Date for Street Reconstruction – Zone G, Phase I Notice of Public Hearing for the Planning Commission To Consider Minor Conditional Use Permit No. 6 Notice of Extending Bid Due Date for Street Reconstruction – Zone G, Phase I Notice Inviting Bids for Appian Way Pump Station Roof Replacement Notice of Adjournment of 7/2 Lomita City Council Meeting to 8/6 Appian Way Pump Station Roof Replacement; Notice of Rejecting All Bids Notice that Lomita City Clerk will Receive Sealed Bids for Street Reconstruction Zone G – Phase 1 Notice of Lomita City Council Public Hearing to Consider a Special Assessment Against Parcel Properties for Unpaid Delinquent Trash Collection Fees Notice of Collective Committee of the County Sanitation Districts of Los Angeles County Meeting to Consider Approval of Proposed Labor Agreements Notice of City of Lomita Commission Vacancies Notice that Lomita City Clerk will Receive Sealed Bids for the Sidewalk Reconstruction Program Notice of Lomita City Council Public Hearing to Consider the Adoption of the Fiscal Year 2024-2026 Biennial Budget Notice of Lomita City Council Public Hearing to Consider Zoning Text Amendment ZTA 2024-04 Notice of Lomita City Council Approval of Resolution No. 2024-09 Notice of Letter of Intent to Award Citywide School Loading Zone Study Notice of Lomita Planning Commission Public Hearing to Consider Conditional Use Permit No. 328 Notice of Lomita Planning Commission Public Hearing to Consider Site Plan Review No. 1050 Notice of Lomita Planning Commission Public Hearing to Consider Zone Map Amendment No. 2024-1 & Zone Text Amendment No. 2024-03 Notice of Lomita Planning Commission Public Hearing to Consider Zoning Text Amendment ZTA 2024-04 Notice of Lomita City Council Public Hearing to Consider General Plan Amendment 2024-01, Zone Text Amendment No. 2024-03, Zone Map Amendment, an Amendment to 24925-25007 Walnut Street’s Land Use Designation From Public/Open Space to High-Density Residential Notice Inviting Bids for Appian Way Pump Station Roof Replacement Notice of Height Variation Permit No. 118 Notice of Lomita City Council Public Hearing for Consideration of General Plan Amendment 2024-01, Zone Text Amendment No. 2024-03, Zone Map Amendment, and Zone Text Amendment No. 2024-02 Notice of Lomita City Council Public Hearing for Consideration of Conditional Use Permit No. 310 Notice of Lomita City Council Public Hearing for Consideration of Vesting Tentative Tract Map No. 74138 Notice of Lomita City Council Public Hearing for Consideration of Vesting Tentative Tract Map No. 83968 Notice of Lomita City Council Public Hearing for Consideration of Vesting Tentative Tract Map No. 74138, Final Map of Tract Map No. 74138, Vesting Tentative Tract Map No. 83968, and Nuisance Abatement Cost Report for 2253-2257 Pacific Coast Highway Notice of Lomita City Council Public Hearing for Consideration of Zone Text Amendment No. 2024-01, an Amendment to Lomita Municipal Code Title XI Article 15 and Article 30 to Allow, Through Conditional Use Permit Approval, Accessory Dwelling Units up to 20 Feet in Height Notice of Lomita Planning Commission Public Hearing for Consideration of Vesting Tentative Tract Map No. 74138 Notice of Lomita Planning Commission Public Hearing for Consideration of Vesting Tentative Tract Map No. 83968 Notice of Lomita Planning Commission Public Hearing for Consideration of Zone Text Amendment No. 2024-01 Notice of Lomita Planning Commission Public Hearing for Consideration of Conditional Use Permit No. 327 Notice of Lomita City Council Public Hearing for Consideration of an Adoption of an Updated City-Wide Master Fee Schedule Notice of Community Development Advisory Board (CDAB) Public Hearing in the matter of 2024-25 CDBG Recommended Projects 2023 Notice of Lomita City Council Public Hearing for Consideration of an Amendment to Lomita Municipal Code Title VIII (Motor Vehicles and Traffic), Chapter 1 (Traffic and Parking), Article 1. (In General), Section 8-1.05(a), To Implement a Defined Length of One Hundred (100) Feet of Vehicle Movement Following Notice of Seventy-Two (72) Hours of Consecutive Non-Movement Notice of Lomita City Council Public Hearing for Consideration of Vesting Tentative Parcel Map No. 83039 Extension Notice of Lomita City Council Public Hearing for Consideration of an Amendment Planning Condition No. 14 Of Planning Commission Resolution No. Pc 2023-14 Notice of Lomita City Council Public Hearing for Consideration of an Amendment to Lomita Municipal Code Title Xi Chapter 1 Article 30 Notice of Lomita City Council Public Hearing for Consideration of a Proposed Increase in Rates for Solid Waste Service Charges Notice of Lomita City Council Public Hearing for Consideration of the Adoption of an Updated Citywide Master Fee Schedule Notice of Lomita City Council Public Hearing for Consideration of an Amendment to Lomita Municipal Code Title I Chapter 5 Notice of Planning Commission Public Hearing for Consideration of Amendment to Site Plan Review No. 1049; Zone Variance No. 246; and Minor Conditional Use Permit No. 5 Notice of City Council Public Hearing for Consideration of Zone Text Amendment No. 2023-06 Notice of City Council Public Hearing for Consideration of Resolution No. 2023-10 Notice of Public Hearing for Planning Commission for Consideration of Zone Text Amendment No. 2023-06 Notice of Public Hearing for Planning Commission for Consideration of Conditional Use Permit No. 323 Notice of City Council Public Hearing for Consideration of Zone Text Amendments No. 2023-03, No. 2023-04 and No. 2023-05 Notice of City of Lomita Planning Commission and Public Safety and Traffic Commission Vacancies Notice of General Plan Advisory Committee Vacancies Notice of Planning Commission Public Hearing for Consideration of Minor Conditional Use Permit No. 4 Notice of Planning Commission Public Hearing for Consideration of Conditional Use Permit No. 224 Notice of Planning Commission Public Hearing for Consideration of Zone Text Amendments No. 2023-03, No. 2023-04 and No. 2023-05 Notice of City Council Public Hearing for Consideration of Zone Text Amendment No. 2023-02 and Lomita Municipal Code Title VI Chapter 8 Notice of City Council Meeting for District Formation Community Workshop Notice of Public Hearing for City Council for Consideration of Council District Maps Notice of Public Hearing for Planning Commission for Consideration of Zone Text Amendment 2023-02 Notice of Public Hearing for Planning Commission for Consideration of Minor Conditional Use Permit 3 & Amendment to Conditional Use Permit 230 Notice of Public Hearing for City Council for Consideration of Housing Planning and Zoning Notice of Public Hearing for Planning Commission for Consideration of Zone Text Amendments Notice of Public Hearing for Planning Commission for Considerations of Permits and Site Plans Notice of Public Hearing Regarding 2023-24 CDBG Recommended Projects Notice of Commission Vacancies 2022 Notice of City Council Reorganization Public Notice of Planning Commission Vacancy Notice of December 12 Public Hearing: CUP No. 322 Notice of Public Hearing to Consider the Possible Adoption of an Updated City-wide Master Fee Schedule Notice of Public Hearing to Consider Special Business License Permit 2022-01 Notice of November 14 Public Hearing: Zone Text Amendment No. 2022-02 Notice of Public Hearing: CUP No. 320 & CUP No. 321 Notice of Public Hearing Regarding Proposed Water Rates Notice of Candidates – Election Cancellation Notice of Public Hearing-Zone Text Amendment and General Plan Amendments Notice of Public Hearing to Consider Transitioning to City Council Districts (English) Notice of Public Hearing to Consider Transitioning to City Council Districts (Spanish) Notice of Continuation of Public Hearing Notice of Intention to Amend the Conflict of Interest Code Planning Commission Notice of Public Hearing: Consideration of Amendments to the Lomita Municipal Code Planning Commission Notice of Continuation of Public Hearing: Alley Vacation, Conditional Use Permit No. 319 & Site Plan Review No. 1213 Planning Commission Notice of Continuation of Public Hearing Notice of Continuation of Public Hearing Planning Commission Notice of June 13 Public Hearing: Zone Text Amendment No. 2022-01 Planning Commission Notice of Public Hearing: Zone Text Amendment No. 2022-01 Planning Commission Notice of Public Hearing: Conditional Use Permit No. 319 & Site Plan Review No. 1213 Fiscal Year 2022-2024 Biennial Budget – FY 22-24 Proposed Biennial Budget Public Hearing Notice – City Council Meeting of June 7 Planning Commission Notice of Public Hearing: Amendment to Conditional Use Permit No. 311 Public Notice of Planning Commission Continuation of Public Hearing Public Notice RAD Public Notice Annual Plan 2022-23 Public Notice of Commission Vacancies Notice of Public Hearing PHN-SPR 1216 Notice of Public Hearing PC PHN Alley Vacation Urgency Ordinance SB9 (002) Notice of Public Hearing for Update Citywide Master Fee Schedule 30 Day Public Notice to Close CDBG FY 21-22 JCBI Notice of Public Hearing: Site Plan Review No. 1204 Public Notice Electric Vehicle Charging Fee VTM 082069 Public Notice Notice of Resolution Adopting Water Shortage Contingency Stage 1 Notice of Public Hearing for Small Business Grant Program FY 2021-22 CDAB Public Notice FY 22-23 Budget Public Notice User Fees Notice of City Council Reorganization Notice of Public Hearing: Zone Text Amendment No. 2021-03 Notice of Continuation of Public Hearing Public Notice Housing Authority Annual Plan 2021-22 1021 Public Hearing Notice for Vesting Tentative Parcel Map Public Hearing Notice for Zone Text Amendment No. 2021-02 to Establish New Sign Standards within the “24000 Crenshaw Boulevard Specific Plan” Public Hearing Notice for Housing and Safety Element at the 12/17/21 City Council Meeting Public Notice SB 1383 Ordinance 1121 2021 Lomita Planning Commission Public Hearings – Housing Element and Safety Element Public Notice Annual Plan 2021-22 1021 Vesting Tentative Parcel Map:25048 Narbonne Avenue Site Plan Review: 25820 Lucille Avenue Notice of Intent to Adopt a Negative Declaration Determination of Similarity No. 2021-01 Vesting Tentative Parcel Map N0. 83029 Vesting Tentative Tract Map N0. 78233 Adjournment of the Regular Meeting of the Lomita City Council scheduled for Tuesday, July 20, 2021, at 6:00 p.m. Conditional Use Permit No. 318 Conditional Use Permit No. 317 Public Notice of Commission Vacancies Conditional Use Permit No. 317 Amendment to Conditional Use Permit No. 304 Site Plan Review No. 1211 and Vesting Tentative Parcel Map No. 83029 Vesting Tentative Tract Map No. 78233/Site Plan Review No. 1209/Zone Variance No. 245/Height Variation Permit No.105 Public Notice of Commission Vacancies Resolution No. 2021-10, Lomita Landscape Maintenance District No. 1 Fiscal Year 2021-2022 Budget Adoption Unscheduled Public Safety & Traffic Commission Vacancy ADA Notice revised May 2021 ADA Grievance Form May 2021 ADA-Section 504 Complaint and Grievance Procedure May 2021 Draft 2020 Urban Water Management Plan (UWMP) Site Plan Review No. 1210 Site Plan Review No. 1211 and Vesting Tentative Parcel Map No. 83029 Vesting Tentative Tract Map No. 78233/Site Plan Review No. 1209/Zone Variance No. 245/Height Variation Permit No.105 Zone Text Amendment NO. 2021-01 Public Hearing – Flood Prevention – City Council, Tuesday, March 2, 6 p.m. Site Plan Review No. 1208 Amendment to Conditional Use Permit No.309 Amendment to Conditional Use Permit No.299 2021-22 CDBG Recommended Projects",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:49"
  },
  "lomitacity.com_wp-content_uploads_2024_02_Exhibit-2024-Legislative-Platform-approved-by-Legislative-": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/02/Exhibit-2024-Legislative-Platform-approved-by-Legislative-Committee.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/02/Exhibit-2024-Legislative-Platform-approved-by-Legislative-Committee.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:52"
  },
  "lomitacity.com_wp-content_uploads_2024_08_2025-Council-Reorganization.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/08/2025-Council-Reorganization.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/08/2025-Council-Reorganization.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:55"
  },
  "lomitacity.com_wp-content_uploads_2023_09_2024-Council-Reorganization.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/09/2024-Council-Reorganization.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/09/2024-Council-Reorganization.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:45:59"
  },
  "lomitacity.com_wp-content_uploads_2022_12_2023-Council-Reorganization-1.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2022/12/2023-Council-Reorganization-1.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2022/12/2023-Council-Reorganization-1.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:02"
  },
  "lomitacity.com_boards-commissions": {
    "url": "https://lomitacity.com/boards-commissions/",
    "title": "Boards & Commissions - City of Lomita",
    "content": "Boards & Commissions Sara Madsen 2025-03-11T16:28:37-07:00 Serving on a board or commission is a voluntary public service. These community based commissions play a vital role in advising the City Council on matters specific to each commission. Thank you for your interest to serve. Commissioners are interviewed and appointed by City Council. All commissioners serve four-year terms. All Commissioners must be residents and electors of the City of Lomita. Boards and Commissions applications are available for pick-up at City Hall or simply click on the link below. A complete Boards and Commissions application must be submitted to the City Clerk’s Office via e-mail l.abbott@lomitacity.com , fax (310) 325-4024 or at City Hall, City Clerk’s Office located at 24300 Narbonne Avenue., Lomita, CA 90717. Applications are accepted on a continuous basis and will be retained in the active file for two years. For more information, please contact the City Clerk’s Office at (310) 325-7110. Boards and Commission Application Local Appointment List Boards and Commissions Agendas & Minutes Meeting Calendar Housing Authority Planning Commission Parks and Recreation Commission Public Safety and Traffic Commission",
    "depth": 4,
    "scraped_at": "2025-04-03 18:46:06"
  },
  "lomitacity.com_wp-content_uploads_2021_10_Boards-and-commisions-application.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/Boards-and-commisions-application.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/Boards-and-commisions-application.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:09"
  },
  "lomitacity.com_wp-content_uploads_2025_01_2025-Maddy-Act-List-of-Appointments-031125.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2025/01/2025-Maddy-Act-List-of-Appointments-031125.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2025/01/2025-Maddy-Act-List-of-Appointments-031125.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:13"
  },
  "lomitacity.com_housing-authority": {
    "url": "https://lomitacity.com/housing-authority/",
    "title": "Housing Authority - City of Lomita",
    "content": "Housing Authority Sara Madsen 2025-02-04T13:50:44-08:00 The Housing Authority of Lomita consists of seven members, the five members of the City Council and 2 appointed tenant commissioners from Lomita Manor. The City Manager’s Department serves as staff to the Authority and prepares staff reports and analysis regarding housing-related issues. The Housing Authority of Lomita also administers federally funded housing programs with the assistance of the Los Angeles County Development Authority (LACDA). Current Commissioners Mark Waronek Chair Cindy Segawa Vice-Chair James Gazeley Commissioner Bill Uphoff Commissioner Barry Waite Commissioner Rosemary Hart Commissioner Judi Larson Commissioner Meeting Information When: 1st Tuesday of each month at 5:45 PM Where: Council Chambers at Lomita City Hall 24300 Narbonne Avenue, Lomita, CA U.S.A. 90717 Meetings are open to the public, and agendas are available at City Hall and online. View Agendas & Minutes Additional Information",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:18"
  },
  "lomitacity.com_planning-commission": {
    "url": "https://lomitacity.com/planning-commission/",
    "title": "Planning Commission - City of Lomita",
    "content": "Planning Commission Sara Madsen 2024-06-18T17:03:20-07:00 The Planning Commission consists of seven members appointed by City Council. The Planning Division serves as staff to the Commission and prepares staff reports and analysis regarding various development applications that require Commission review. The duties and responsibilities of the Planning Commission are governed by State Law and Lomita Municipal Code Section 2, Title I . Current Commissioners Bob Steinbach Term Ends June 2025 Steven Cammarata Term Ends June 2025 Joaquin Santos Term Ends June 2026 Michael Graf Term Ends June 2026 Monica Dever Term Ends June 2027 Jay Mattingly Term Ends June 2027 Brenda Stephens Term Ends June 2028 Meeting Information When: 2nd Monday each month at 6:00 PM Where: Council Chambers at Lomita City Hall 24300 Narbonne Avenue, Lomita, CA U.S.A. 90717 Meetings are open to the public, and agendas are available at City Hall and online. View Agendas & Minutes",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:23"
  },
  "lomitacity.com_parks-recreation-commission": {
    "url": "https://lomitacity.com/parks-recreation-commission/",
    "title": "Parks and Recreation Commission - City of Lomita",
    "content": "Parks and Recreation Commission Sara Madsen 2025-03-11T16:10:48-07:00 The Parks and Recreation Commission consist of five members appointed by City Council. The duties and responsibilities of the Commission are to act in an advisory capacity to the City Council in all matters pertaining to recreation and parks. The Commission is also responsible for matters relative to street trees within the City. The Parks and Recreation Division serves as staff to the Commission. The duties and responsibilities of the Parks and  Recreation Commission are governed by Lomita Municipal Code Chapter 10, Title I . Current Commissioners Katy Tamer Term Ends June 2025 Cristina De Leon Allred Term Ends June 2025 Cecilia Torrente Term Ends June 2026 Carol Graf Term Ends June 2026 Allen Danielson Term Ends June 2028 Meeting Information When: 4th Tuesday of each month at 6:00 PM Where: Council Chambers at Lomita City Hall 24300 Narbonne Avenue, Lomita, CA U.S.A. 90717 Meetings are open to the public, and agendas are available at City Hall and online here . View Agendas & Minutes",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:28"
  },
  "lomitacity.com_public-safety-traffic-commission": {
    "url": "https://lomitacity.com/public-safety-traffic-commission/",
    "title": "Public Safety and Traffic Commission - City of Lomita",
    "content": "Public Safety and Traffic Commission Sara Madsen 2024-06-18T17:26:21-07:00 The Public Safety and Traffic Commission consists of 5 members appointed by City Council. The duties and responsibilities of the Commission are to act in an advisory capacity to the City Council in all matters pertaining to public safety and traffic. The Public Works Department serves as staff to the Commission. The duties and responsibilities of the Public Safety and Traffic Commission are governed by Lomita Municipal Code Chapter 12, Title I. Current Commissioners Mike Cozzolino Term Ends June 2025 Irene Kurata Term Ends June 2026 John Ballard Term Ends June 2026 Jessiqa Pace Term Ends June 2027 John Carmody Term Ends June 2028 Meeting Information When: 3rd Wednesday of each month at 6:00 PM Where: Council Chambers at Lomita City Hall 24300 Narbonne Avenue, Lomita, CA U.S.A. 90717 Meetings are open to the public, and agendas are available at City Hall and online here . View Agendas & Minutes",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:32"
  },
  "lomitacity.com_author_tsakalee": {
    "url": "https://lomitacity.com/author/tsakalee/",
    "title": "Kalee Cummings - City of Lomita",
    "content": "About Kalee Cummings This author has not yet filled in any details. So far Kalee Cummings has created 0 blog entries.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:44"
  },
  "lomitacity.com_wp-content_uploads_2024_08_City-Hall-2025-yearly-calendar-with-Council-Dates-1.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/08/City-Hall-2025-yearly-calendar-with-Council-Dates-1.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/08/City-Hall-2025-yearly-calendar-with-Council-Dates-1.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:46:47"
  },
  "lomitacity.com_granicus-archive": {
    "url": "https://lomitacity.com/granicus-archive/",
    "title": "Granicus Archive - City of Lomita",
    "content": "Granicus Archive Kayla Cao 2022-12-21T19:20:17-08:00",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:15"
  },
  "lomitacity.com_archived-planning-commission-agendas": {
    "url": "https://lomitacity.com/archived-planning-commission-agendas/",
    "title": "Archived Planning Commission Agendas - City of Lomita",
    "content": "Archived Planning Commission Agendas Kendall Lowery 2024-11-07T13:03:05-08:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Planning Commission To view video recordings of the Planning Commission meetings, click here . 2024 2023 2022 2021 2020 2019 2024 Date & Meeting Agenda Minutes May 13, 2024 Lomita Planning Commission – Regular Meeting PDF – April 8, 2024 Lomita Planning Commission – Regular Meeting PDF – March 11, 2024 Lomita Planning Commission – Regular Meeting PDF – Febryary 12, 2024 Lomita Planning Commission – Regular Meeting PDF – January 8, 2024 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – 2023 Date & Meeting Agenda Minutes January 8, 2023 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – December 11, 2023 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – November 13, 2023 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – October 9, 2023 Lomita Planning Commission – Regular Meeting PDF PDF September 11, 2023 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – August 14, 2023 Lomita Planning Commission – Regular Meeting PDF PDF July 10, 2023 Lomita Planning Commission – Regular Meeting PDF PDF June 12, 2023 Lomita Planning Commission – Regular Meeting PDF PDF May 8, 2023 Lomita Planning Commission – Regular Meeting PDF PDF April 10, 2023 Lomita Planning Commission – Regular Meeting PDF PDF March 13, 2023 Lomita Planning Commission – Regular Meeting PDF PDF February 13, 2023 Lomita Planning Commission – Regular Meeting – Item No. PH6, Attachment 1 was revised on February 9, 2023. PDF Revision PDF January 9, 2023 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – 2022 Date & Meeting Agenda Minutes December 12, 2022 Lomita Planning Commission – Regular Meeting PDF PDF November 14, 2022 Lomita Planning Commission – Regular Meeting PDF PDF October 10, 2022 Lomita Planning Commission – Regular Meeting PDF PDF September 12, 2022 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – August 8, 2022 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – July 11, 2022 Lomita Planning Commission – Regular Meeting PDF PDF June 13, 2022 Lomita Planning Commission – Regular Meeting PDF Revised Item PH 6 Attachment 1C dated 6/13/2022 PDF May 9, 2022 Lomita Planning Commission – Public Hearing Continuation PDF Public Notice PDF April 11, 2022 Lomita Planning Commission – Regular Meeting PDF PDF March 14, 2022 Lomita Planning Commission – Regular Meeting PDF PDF February 14, 2022 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – January 10, 2022 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – 2021 Date & Meeting Agenda Minutes December 13, 2021 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – November 15, 2021 Lomita Planning Commission – Special Meeting PDF PDF November 8, 2021 Lomita Planning Commission – Regular Meeting PDF PDF October 11, 2021 Lomita Planning Commission – Regular Meeting PDF PDF September 13, 2021 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – August 9, 2021 Lomita Planning Commission – Regular Meeting PDF PDF July 12, 2021 Lomita Planning Commission – Regular Meeting PDF PDF June 14, 2021 Lomita Planning Commission – Regular Meeting PDF PDF May 10, 2021 Lomita Planning Commission – Regular Meeting PDF PDF April 12, 2021 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – March 8, 2021 Lomita Planning Commission – Regular Meeting PDF PDF February 8, 2021 Lomita Planning Commission – Regular Meeting PDF PDF January 11, 2021 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – 2020 Date & Meeting Agenda Minutes December 14, 2020 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – November 9, 2020 Lomita Planning Commission – Regular Meeting PDF PDF October 12, 2020 Lomita Planning Commission – Regular Meeting PDF PDF September 14, 2020 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – August 10, 2020 Lomita Planning Commission – Regular Meeting PDF PDF July 13, 2020 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – June 8, 2020 Lomita Planning Commission – Regular Meeting PDF PDF May 11, 2020 Lomita Planning Commission – Regular Meeting PDF PDF April 13, 2020 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – March 9, 2020 Lomita Planning Commission – Regular Meeting PDF PDF February 10, 2020 Lomita Planning Commission – Regular Meeting PDF PDF January 13, 2020 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – 2019 Date & Meeting Agenda Minutes December 9, 2019 Lomita Planning Commission – Regular Meeting PDF PDF November 12, 2019 Lomita Planning Commission – Regular Meeting PDF PDF October 14, 2019 Lomita Planning Commission – Regular Meeting PDF PDF September 9, 2019 Lomita Planning Commission – Regular Meeting PDF PDF August 12, 2019 Lomita Planning Commission – Regular Meeting PDF PDF July 8, 2019 Lomita Planning Commission – Regular Meeting (Cancellation) – – June 10, 2019 Lomita Planning Commission – Regular Meeting PDF PDF May 13, 2019 Lomita Planning Commission – Regular Meeting (Cancellation) – – April 8, 2019 Lomita Planning Commission – Regular Meeting PDF PDF March 11, 2019 Lomita Planning Commission – Regular Meeting PDF PDF February 11, 2019 Lomita Planning Commission – Regular Meeting PDF PDF January 14, 2019 Lomita Planning Commission – Regular Meeting PDF PDF",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:20"
  },
  "lomitacity.com_archived-lomita-housing-authority-agendas": {
    "url": "https://lomitacity.com/archived-lomita-housing-authority-agendas/",
    "title": "Archived Lomita Housing Authority Agendas - City of Lomita",
    "content": "Archived Lomita Housing Authority Agendas Kendall Lowery 2024-06-02T23:17:02-07:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Lomita Housing Authority 2024 2023 2022 2021 2020 2019 2024 Date & Meeting Agenda Minutes June 4, 2024 Lomita Housing Authority Meeting – Regular Meeting PDF – May 7, 2024 Lomita Housing Authority – Regular Meeting PDF – April 2, 2024 Lomita Housing Authority – Regular Meeting PDF – March 5, 2024 Lomita Housing Authority – Regular Meeting PDF – February 6, 2024 Lomita Housing Authority – Regular Meeting PDF – January 16, 2024 Lomita Housing Authority – Special Meeting PDF – January 2, 2024 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – 2023 Date & Meeting Agenda Minutes January 2, 2023 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – December 5, 2023 Lomita Housing Authority – Adjourned Regular Meeting PDF – November 7, 2023 Lomita Housing Authority – Regular Meeting PDF PDF October 3, 2023 Lomita Housing Authority – Regular Meeting PDF – September 5, 2023 Lomita Housing Authority – Regular Meeting PDF – August 1, 2023 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – July 4, 2023 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – June 6, 2023 Lomita Housing Authority – Regular Meeting PDF PDF May 2, 2023 Lomita Housing Authority – Regular Meeting PDF PDF April 4, 2023 Lomita Housing Authority – Regular Meeting PDF PDF March 7, 2023 Lomita Housing Authority – Regular Meeting PDF PDF February 7, 2023 Lomita Housing Authority – Regular Meeting PDF PDF January 3, 2023 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – 2022 Date & Meeting Agenda Minutes December 6, 2022 Lomita Housing Authority – Regular Meeting PDF – November 1, 2022 Lomita Housing Authority – Regular Meeting PDF PDF October 4, 2022 Lomita Housing Authority – Regular Meeting PDF – September 6, 2022 Lomita Housing Authority – Regular Meeting PDF – August 2, 2022 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – July 5, 2022 Lomita Housing Authority – Regular Meeting PDF PDF June 7, 2022 Lomita Housing Authority – Regular Meeting PDF PDF May 3, 2022 Lomita Housing Authority – Regular Meeting PDF PDF April 5, 2022 Lomita Housing Authority – Regular Meeting PDF PDF March 1, 2022 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – February 1, 2022 Lomita Housing Authority – Regular Meeting PDF PDF January 4, 2022 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – 2021 Date & Meeting Agenda Minutes December 7, 2021 Lomita Housing Authority – Regular Meeting PDF PDF November 2, 2021 Lomita Housing Authority – Regular Meeting PDF PDF October 5, 2021 Lomita Housing Authority – Regular Meeting PDF PDF September 7, 2021 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – August 17, 2021 Lomita Housing Authority – Special Meeting PDF PDF August 3, 2021 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – July 6, 2021 Lomita Housing Authority – Regular Meeting PDF PDF June 1, 2021 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – May 4, 2021 Lomita Housing Authority – Regular Meeting PDF PDF April 6, 2021 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – March 2, 2021 Lomita Housing Authority – Regular Meeting PDF PDF February 2, 2021 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – January 5, 2021 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – 2020 Date & Meeting Agenda Minutes December 1, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – November 3, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – October 6, 2020 Lomita Housing Authority – Regular Meeting PDF PDF September 1, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – August 4, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – July 7, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – June 2, 2020 Lomita Housing Authority – Regular Meeting PDF PDF May 5, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – April 7, 2020 Lomita Housing Authority – Regular Meeting PDF PDF March 3, 2020 Lomita Housing Authority – Regular Meeting PDF PDF February 4, 2020 Lomita Housing Authority – Regular Meeting PDF PDF January 7, 2020 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – 2019 Date & Meeting Agenda Minutes December 3, 2019 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – November 5, 2019 Lomita Housing Authority – Regular Meeting PDF PDF October 1, 2019 Lomita Housing Authority – Regular Meeting PDF PDF September 3, 2019 Lomita Housing Authority – Regular Meeting PDF PDF August 6, 2019 Lomita Housing Authority – Regular Meeting PDF PDF July 2, 2019 Lomita Housing Authority – Regular Meeting (Cancellation) PDF – June 4, 2019 Lomita Housing Authority – Regular Meeting PDF PDF May 7, 2019 Lomita Housing Authority – Regular Meeting PDF PDF April 2, 2019 Lomita Housing Authority – Regular Meeting PDF PDF March 19, 2019 Lomita Housing Authority – Regular Meeting PDF PDF February 5, 2019 Lomita Housing Authority – Regular Meeting PDF PDF January 2, 2019 Lomita Housing Authority – Regular Meeting (Cancellation) PDF –",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:25"
  },
  "lomitacity.com_archived-lomita-public-safety-and-traffic-commission-agendas": {
    "url": "https://lomitacity.com/archived-lomita-public-safety-and-traffic-commission-agendas/",
    "title": "Archived Lomita Public Safety and Traffic Commission Agendas - City of Lomita",
    "content": "Archived Lomita Public Safety and Traffic Commission Agendas Kendall Lowery 2024-11-07T13:39:02-08:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Lomita Public Safety and Traffic Commission 2024 2023 2022 2021 2020 2019 2024 Date & Meeting Agenda Minutes May 15, 2024 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – April 17, 2024 Lomita Public Safety and Traffic Commission – Regular Meeting PDF – March 20, 2024 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – February 21, 2024 Lomita Public Safety and Traffic Commission – Regular Meeting PDF – January 17, 2024 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – 2023 Date & Meeting Agenda Minutes December 20, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – November 15, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF October 18, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – September 20, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF August 16, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – July 19, 2023 Lomita Public Safety and Traffic Commission – Traffic Calming Community Workshop PDF PDF June 21, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF May 17, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF March 15, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – February 15, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF January 18, 2023 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – 2022 Date & Meeting Agenda Minutes December 21, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – November 16, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – October 19, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF September 21, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – August 17, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – July 20, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – June 15, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF May 18, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF April 20, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – March 16, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF February 16, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – January 19, 2022 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF 2021 Date & Meeting Agenda Minutes December 15, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – November 17, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – October 20, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF September 22, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – August 18, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – July 21, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF June 16, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – May 19, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – April 21, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF March 17, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF February 17, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – January 20, 2021 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF 2020 Date & Meeting Agenda Minutes December 16, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF November 18, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – October 21, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – September 16, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – August 19, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF July 15, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF June 17, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – May 20, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF April 15, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – March 18, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – February 19, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF January 15, 2020 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – 2019 Date & Meeting Agenda Minutes December 18, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF November 20, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – October 16, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – September 18, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF August 21, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting (Cancellation) PDF – July 17, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF June 19, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF May 15, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF April 17, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF March 20, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF February 20, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF January 16, 2019 Lomita Public Safety and Traffic Commission – Regular Meeting PDF PDF",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:30"
  },
  "lomitacity.com_archived-parks-and-recreation-commission-agendas": {
    "url": "https://lomitacity.com/archived-parks-and-recreation-commission-agendas/",
    "title": "Archived Parks and Recreation Commission Agendas - City of Lomita",
    "content": "Archived Parks and Recreation Commission Agendas Kendall Lowery 2024-05-23T11:30:48-07:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Parks and Recreation Commission 2024 2023 2022 2021 2020 2019 2024 Date & Meeting Agenda Minutes May 28, 2024 Lomita Parks and Recreation Commission – Regular Meeting PDF – April 23, 2024 Lomita Parks and Recreation Commission – Regular Meeting PDF – March 26, 2024 Lomita Parks and Recreation Commission – Regular Meeting PDF – February 27, 2024 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF January 23, 2024 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF 2023 . Date & Meeting Agenda Minutes December 26, 2023 Lomita Parks and Recreation Commission – Cancellation Notice PDF – November 28, 2023 Lomita Parks and Recreation Commission – Cancellation Notice PDF – October 24, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF September 26, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF August 22, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF July 25, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF June 27, 2023 Lomita Planning Commission – Regular Meeting (Cancellation) PDF – May 23, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF April 25, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF March 28, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF February 28, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF January 24, 2023 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF 2022 Date & Meeting Agenda Minutes December 27, 2022 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF November 22, 2022 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF October 25, 2022 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF September 27, 2022 Lomita Parks and Recreation Commission – Regular Meeting – Staff Report PDF PDF August 23, 2022 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF July 26, 2022 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF June 28, 2022 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF May 24, 2022 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF April 26, 2022 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF March 22, 2022 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – February 22, 2022 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – January 25, 2022 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – 2021 Date & Meeting Agenda Minutes December 28, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – October 26, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – September 28, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – August 24, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – July 27, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – June 22, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – May 25, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – April 27, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – March 23, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – February 23, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – January 26, 2021 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – 2020 Date & Meeting Agenda Minutes December 22, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – November 24, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – October 27, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – September 22, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – August 25, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – July 28, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – June 23, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – May 26, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – April 4, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – March 24, 2020 Lomita Parks and Recreation Commission – Regular Meeting (Cancellation) PDF – February 25, 2020 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF January 28, 2020 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF 2019 Date & Meeting Agenda Minutes November 26, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF October 22, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF September 24, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF – August 27, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF July 23, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF June 25, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF May 28, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF – April 23, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF March 26, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF February 26, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF January 22, 2019 Lomita Parks and Recreation Commission – Regular Meeting PDF PDF",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:34"
  },
  "lomitacity.com_archived-community-development-advisory-board-agendas": {
    "url": "https://lomitacity.com/archived-community-development-advisory-board-agendas/",
    "title": "Archived Community Development Advisory Board Agendas - City of Lomita",
    "content": "Archived Community Development Advisory Board Agendas Kendall Lowery 2024-04-16T13:05:58-07:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Community Development Advisory Board 2024 2023 2022 2021 2024 Date & Meeting Agenda Minutes January 16, 2024 – Community Development Advisory Board Meeting PDF 2023 Date & Meeting Agenda Minutes February 7, 2023 – Community Development Advisory Board Meeting PDF 2022 Date & Meeting Agenda Minutes June 21, 2022 – Special Community Development Advisory Board Meeting PDF January 18, 2022 – Annual Community Development Advisory Board Meeting Public Hearing Notice – Small Business Grant Program Public Hearing Notice – Proposed Total Budget PDF PDF 2021 Date & Meeting Agenda Minutes January 19, 2021 – Annual Community Development Advisory Board Meeting PDF PDF",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:39"
  },
  "lomitacity.com_archived-lomita-public-financing-authority-agendas": {
    "url": "https://lomitacity.com/archived-lomita-public-financing-authority-agendas/",
    "title": "Archived Lomita Public Financing Authority Agendas - City of Lomita",
    "content": "Archived Lomita Public Financing Authority Agendas Kendall Lowery 2024-04-16T13:06:10-07:00 If you would like to request a hard copy of any meeting agenda or related documents, please contact Deputy City Clerk Linda Abbott ( l.abbott@lomitacity.com ) or call the City Clerk’s Office (310) 325-7110. Lomita Public Financing Authority 2022 2022 Date & Meeting Agenda Minutes May 17, 2022 Lomita Public Financing Authority – Special Meeting PDF",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:43"
  },
  "lomitacity.com_state-regional-elected-officials": {
    "url": "https://lomitacity.com/state-regional-elected-officials/",
    "title": "State & Regional Elected Officials - City of Lomita",
    "content": "State & Regional Elected Officials Kendall Lowery 2024-07-02T11:07:51-07:00 Federal, State and Los Angeles County elected officials representing the City of Lomita are listed below.  For City of Lomita elected officials, please visit the City Council page . Federal Government United States Senate : Senator Alex Padilla & Senator Laphonza R. Butler United States House of Representatives : Congressman Ted Lieu, California’s 33rd District State of California State of California : Governor Gavin Newsom California State Senate : Senator Ben Allen, Senate District 24 California State Assembly : Assemblymember Al Muratsuchi, Assembly District 66 California Senate District 24 consists of the cities of Lomita, Hermosa Beach, Manhattan Beach, Redondo Beach, Palos Verdes Estates, Rancho Palos Verdes, Rolling Hills, Rolling Hills Estates, El Segundo, Avalon, Torrance, Santa Monica, West Hollywood, and Beverly Hills; the Los Angeles neighborhoods of Playa del Rey, Venice, Westchester, Pacific Palisades, Brentwood, Westwood, Westwood Village, Bel Air, Holmby Hills, Little Holmby, Sunset Hills, Beverly Grove, Mar Vista, Mid City West, Miracle Mile, San Clemente Island, Larchmont Village, Hollywood, Hollywood Hills, Fairfax, Carthay, Fremont Place, Hancock Park, and Windsor Square; and the unincorporated Los Angeles County communities of Marina Del Rey, Santa Catalina Island, Franklin, Centinela, and Ocean View. California Assembly District 66 includes Lomita, Hermosa Beach, El Camino Village, Gardena, the Los Angeles neighborhoods of Harbor City and Harbor Gateway, Manhattan Beach, Palos Verdes Estates, Rancho Palos Verdes, Redondo Beach, Rolling Hills, Rolling Hills Estates, Torrance, and West Carson. Los Angeles County Los Angeles County : Supervisor Janice Hahn, 4th District Los Angeles County’s 4th District encompasses the Cities of Lomita, Artesia, Avalon, Commerce, Cudahy, Bell, Bellflower, Bell Gardens, Cerritos, Downey, Hawaiian Gardens, Huntington Park, La Habra Heights, La Mirada, Lakewood, Long Beach, Los Angeles (portion), Lynwood, Maywood, Norwalk, Palos Verdes Estates, Paramount, Pico Rivera, Rancho Palos Verdes, Rolling Hills, Rolling Hills Estates, Santa Fe Springs, Signal Hill, South Gate, Torrance, Vernon, Whittier. It also includes the unincorporated areas of Cerritos Islands, East La Mirada, East Whittier, La Rambla, Unincorporated Long Beach, Los Nietos, Northwest Whittier, San Clemente Island, Santa Catalina Island, South Whittier, Walnut Park, West Whittier, Westfield. Additionally, it includes the Los Angeles neighborhoods of Harbor City, San Pedro, and Wilmington. Los Angeles Unified School District Los Angeles Unified School District : Board Member Tanya Ortiz Franklin, 7th District LAUSD’s 7th District serves approximately 175 schools in the communities of Lomita, Florence-Firestone, South LA, Watts, Gardena, Carson, Harbor City, Wilmington, and San Pedro.",
    "depth": 4,
    "scraped_at": "2025-04-03 18:47:47"
  },
  "lomitacity.com_author_tskendall": {
    "url": "https://lomitacity.com/author/tskendall/",
    "title": "Kendall Lowery - City of Lomita",
    "content": "About Kendall Lowery This author has not yet filled in any details. So far Kendall Lowery has created 6 blog entries. Road Construction Delay Along Walnut St. (including 241st St., April Ct., Callison St., Terrell St., and Nordman St.) Take the Local Hazard Mitigation Plan Survey City of Lomita Publishes 2023 Community Survey Results In October we Celebrate City Planners and Code Enforcement October is designated as National Community Planning Month, a time [...] City Renews American Red Cross Agreement Designating the Tom Rico Center as an Emergency Shelter On Tuesday, August 15, 2023, the City of Lomita extended [...] City of Lomita’s Summer 2023 Teen Program Revival This past summer, the City of Lomita Recreation and Facilities [...]",
    "depth": 5,
    "scraped_at": "2025-04-03 18:47:52"
  },
  "lomitacity.com_administrative-services": {
    "url": "https://lomitacity.com/administrative-services/",
    "title": "Administrative Services - City of Lomita",
    "content": "Administrative Services Melanie Moore 2024-01-30T15:06:50-08:00 The Administrative Services Department manages the fiscal and financial affairs of the City in a prudent and effective manner. It provides accurate, timely, and comprehensive financial information to the City Manager, City Council, other City departments and the general public; and maintains the financial health, stability and well-being of the City. Key responsibilties: Cash and investment management Financial reporting Operating and capital improvement program budgets Debt administration Payroll Accounts Payable Accounts Receivable Purchasing Utility Billing Business License Alarm permits Budgets Business Licensing Finance Utility Billing Contact Us Call us: (310) 325-7110 Email us Our Location 24300 Narbonne Ave. Lomita, CA U.S.A. 90717 Department Head Susan Kamada Administrative Services Director",
    "depth": 4,
    "scraped_at": "2025-04-03 18:47:57"
  },
  "lomitacity.com_author_tsamelaniem": {
    "url": "https://lomitacity.com/author/tsamelaniem/",
    "title": "Melanie Moore - City of Lomita",
    "content": "About Melanie Moore This author has not yet filled in any details. So far Melanie Moore has created 0 blog entries.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:02"
  },
  "lomitacity.com_budgets": {
    "url": "https://lomitacity.com/budgets/",
    "title": "Budgets - City of Lomita",
    "content": "Budgets Melanie Moore 2024-07-16T11:02:50-07:00 The City’s annual budget serves as a financial plan for the city which identifies the projected allocation and application of resources over the budget cycle. Adopted Fiscal Year 2024-2026 Budget Adopted Budget Fiscal Year 2024-2026 FY 24-26 Budget (by individual sections) • Cover Page – Table of Contents • Introduction • Budget Users Guide • Budget Adoption and Resolutions • Budget Message • Financial Overview • City Manager • Administrative Services • Community Economic Development • Parks and Recreation • Public Works • Internal Service and Fiduciary • Capital Improvements Project • Appendix Archived Budgets Adopted Fiscal Year 2022-2024 Budget: FY 2022-2024 Budget Budget Infographic Adopted Fiscal Year 2021-2022 Budget: FY 2021-2022 Budget Budget Infographic Adopted Fiscal Year 2020-2021 Budget: FY 2020-2021 Budget Budget Infographic Adopted Fiscal Year 2019-2020 Budget: FY 2019-2020 Budget City Manage Budget Message Public Review – Fiscal Year 2020/2021 Proposed Draft Budget",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:07"
  },
  "lomitacity.com_business-licensing": {
    "url": "https://lomitacity.com/business-licensing/",
    "title": "Business Licensing - City of Lomita",
    "content": "Business Licensing Melanie Moore 2025-03-31T16:06:20-07:00 Welcome to Lomita! We are pleased that you are becoming a part of our Lomita business community and we wish you much success. Taxes and fees collected as part of the Business License program help fund essential services in the City. The Business License Division is responsible for levying and collecting taxes, fees, and other assessments as well as licensing and permitting all businesses throughout the City. Clarification and definitions can be found in the Lomita Municipal Code, Title VI. Title VI of the Lomita Municipal Code (Business, Professions and Trades) establishes business license rules and regulations within the City. As defined in Section 6-1.03 of the LMC, Businesses, professions and trades shall mean the conducting, carrying on, managing or operating of any purposeful activity, whether legal or illegal, profitable or unprofitable, intended to generate revenue, whether or not said business, profession or trade has a fixed place of business in the city. In addition, the business license law shall apply to all persons conducting a business, profession or trade within the city whether or not such person maintains a fixed place of business in the city and whether or not such person may primarily conduct his business, profession or trade elsewhere. For those businesses involving animals, the City of Lomita has contracted with the County of Los Angeles Department of Animal Care & Control to ensure that animals are cared for properly in animal-related businesses. These trained Animal Control officers inspect and grade dog and cat boarding facilities, pet shops, grooming parlors, animal menageries, non-profit humane organizations, animal training facilities, rooster facilities, animal exhibition events and mobile groomers. They also inspect businesses with guard dogs and establishments that require a conditional use permit. Letter grades are given to each business similar to the County’s restaurant grading system. Please see DACC’s information on facility licensing here . How to Apply for a Business License We’ve Gone Digital! All steps of the business license application process can now be completed online. Start Your Application What to Expect As you move through the application process, you will be prompted to provide different information based on your answers to the application questions. All applicants are required to complete the zoning verification and the storm water form. Depending on your business, you may also be required to attach the following documents: driver’s license, Articles of Incorporation, Fictitious Business Statement, Resale License/Seller’s Permit, and applicable state licenses. Questions If you require assistance or have any questions, please contact the Business License Division (310) 325-7110 extension 137. Business License Regulations Business License Regulation Home Occupation Permit Regulations Information about NPDES/SB 205 form Business License Fees For information regarding the cost of obtaining a business license, please contact Business License at (310) 325-7110 extension 137.",
    "depth": 4,
    "scraped_at": "2025-04-03 18:48:25"
  },
  "lomitacity.com_finance": {
    "url": "https://lomitacity.com/finance/",
    "title": "Finance - City of Lomita",
    "content": "Finance cityoflomita 2025-01-08T12:07:56-08:00 An Annual Comprehensive Financial Report is a set of financial statements for a state, municipality or other governmental entity that comply with the accounting requirements established by the Governmental Accounting Standards Board (GASB). It must be audited by an independent auditor using generally accepted government auditing standards. ​​ ​ ​The Annual Comprehensive Financial Report consists of three sections: Introductory, Financial and Statistical. The Introductory section orients and guides the reader through the report. The Financial section presents the entity’s basic financial statements as well as notes to the statements and the independent auditors’ report. The Statistical section provides additional financial and statistical data, including data about financial trends that may better inform the reader about the government’s activities. ​ ​Since 2004 the City of Lomita has received the Government Finance Officers Association (GFOA) Certificate of Achievement for Excellence in Financial Reporting for our Annual Comprehensive Financial Report.​​​​ ​ ​The GFOA established the Certificate of Achievement for Excellence in Financial Reporting Program (Annual Comprehensive Financial Report Program) in 1945 to encourage and assist state and local governments to go beyond the minimum requirements of generally accepted accounting principles to prepare annual comprehensive financial reports that evidence the spirit of transparency and full disclosure and then to recognize individual governments that succeed in achieving that goal.​​ ​ ​The Government Finance Officers Association (GFOA), founded in 1906, represents public finance officials throughout the United States and Canada. GFOA’s mission is to advance excellence in public finance. Annual Comprehensive Financial Reports (ACFR) ACFR Year Ended June 30, 2024 ACFR Year Ended June 30, 2023 ACFR Year Ended June 30, 2022 ACFR Year Ended June 30, 2021 ACFR Year Ended June 30, 2020 Single Audit Reports Single Audit Report Year Ended June 30, 2023 Single Audit Report Year Ended June 30, 2022 Single Audit Report Year Ended June 30, 2021 Budget at a Glance Fiscal Year 2024-2025 Ad Hoc Finance Committee On October 15, 2012, the City Council adopted Resolution No. 2012-42 creating an Ad Hoc Finance Committee. The Ad Hoc Committee consists of the Mayor and Mayor Pro-Tem. The purpose of the Ad Hoc Finance Committee is to study the City’s annual operating and CIP budgets, periodically review investment, reserve and purchasing policies and make recommendations to the full Council on such issues.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:16"
  },
  "lomitacity.com_utility-billing": {
    "url": "https://lomitacity.com/utility-billing/",
    "title": "Utility Billing - City of Lomita",
    "content": "Utility Billing Melanie Moore 2024-09-23T11:19:03-07:00 Here you will find information regarding the City’s water rates and billing resources. For questions regarding your water bill you may contact Martha Harris at 310-325- 7110, x139 or via email at m.harris@lomitacity.com . The City Council adopted five year water rates effective March of 2014. The cost of purchasing water from imported sources (Metropolitan Water District of Southern California via West Basin) continues to rise significantly each year. The City continues to produce groundwater at the Cypress Water Production Facility (CWPF) which has enabled the City to reduce the amount of imported water we must purchase to meet the city needs. The CWPF continues to use this local groundwater which we are able to blend with imported water. This has resulted in significant cost savings for the City and its water customers. Water Quality Report Information (Lomita Water System) The City’s Annual Water Quality Report will be available by July 1 of each year. View Water Quality Reports Water Rate Reference Documents Resolution No. 2022-34 Adoption of 5 Year Water Rates Final Report – Water Rate Analysis (2022) Application Forms Applications to start and stop water service can be accessed by clicking the links below: START Water Service STOP Water Service Water Rate Information The Lomita City Council held a public hearing on October 18, 2022 and approved a new 5-year rate structure for its water service. Reasons for the Rate Increase The mission of the City’s water system is to continue to provide reliable, high quality and cost effective water service to its current and future customers. The cost to purchase imported water from West Basin Municipal Water District continues to rise. CIP funding is needed to rehabilitate/replace water meters, fire hydrants, mains and associated facilities. While Operation & Maintenance (O & M) costs continue to creep higher, the City’s ability to pump a portion of its own water from its city well (Well No. 5) have offset what would have been significantly higher increases if the City were 100% reliant on imported water from West Basin Municipal Water District. The current water master plan includes recommendations for improvements to the operation and maintenance (O & M) program, capital improvement program (CIP) and development of a financing mechanism to implement the improvements. Basis of Adopted Rates State law allows for the collection of additional revenues to cover the cost of providing water service subject to noticing and a majority protest hearing (commonly referred to as a Proposition 218 hearing). Costs included in the rates are electricity, equipment, personnel, supplies, etc. Without a rate increase, the City’s Water Fund will eventually run a deficit balance. The proposed rates will allow the City’s water utility to continue operation while providing essential services to its ratepayers. The proposed rates are proportional to the cost of providing the service and revenues from the rates do not exceed the City’s costs, as set forth in the City’s Final Report – Water Rate Analysis, available by at the link above or in the Lomita City Clerk’s office at 24300 Narbonne Avenue, Lomita, CA 90717. Approved Water Rate Increases The rate structure approved in October 2022 is implemented over a five-year period beginning in January 2023 with the final rate increase occurring on July 1, 2027. The tables below display the increases in the bi-monthly meter charge (by meter size and use) and commodity rates per Hundred Cubic Foot (HCF) for Residential and Non-Residential customers over the five-year period: How To Calculate Your Bill Typical Single Family Residential Water User (Bi-Monthly Bill) Meter Charge (3/4″) Commodity Charge* (20 HCF) Total – Bi-Monthly Bill FY 20-21 $50.31 + $95.80 = $146.11 * Typical user at 20 HCF consumption for the two month period. More Information Notice of Public Hearing on February 11, 2015 regarding water rate increases. If you have questions, please contact the Public Works Department at (310) 325-7110.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:21"
  },
  "lomitacity.com_wp-content_uploads_2021_10_Home-Occupation-Permit-Regulations.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/10/Home-Occupation-Permit-Regulations.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/10/Home-Occupation-Permit-Regulations.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:28"
  },
  "lomitacity.com_wp-content_uploads_2025_01_Business-License-Fees-Annual-Rate-Increase-website-posting": {
    "url": "https://lomitacity.com/wp-content/uploads/2025/01/Business-License-Fees-Annual-Rate-Increase-website-posting-2025.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2025/01/Business-License-Fees-Annual-Rate-Increase-website-posting-2025.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:31"
  },
  "lomitacity.com_wp-content_uploads_2023_10_City-Wide-Org-24-26-Revised-6.11.24.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/10/City-Wide-Org-24-26-Revised-6.11.24.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/10/City-Wide-Org-24-26-Revised-6.11.24.pdf",
    "content": "",
    "depth": 4,
    "scraped_at": "2025-04-03 18:48:34"
  },
  "lomitacity.com_city-manager": {
    "url": "https://lomitacity.com/city-manager/",
    "title": "City Manager’s Department - City of Lomita",
    "content": "City Manager’s Department Sara Madsen 2024-08-20T11:36:44-07:00 The City Manager is appointed by the City Council and carries out the policies enacted by the City Council and is responsible for the day-to-day operation of the City government. Specific duties include preparing and presenting a balanced annual budget for the City Council, serving as the Emergency Operations Director, and serving as the Personnel Officer. The City Manager’s Office oversees the City Clerk’s division (elections and records keeping), CDBG programs, emergency management, the Lomita housing Authority, parking enforcement/crossing guards, public safety, solid waste, and Recreation Services and programs. The City Manager is also responsible for oversight of all other City departments and divisions which include: Administrative Services (finance and utility billing), Community Development and Economic Development, Public Works (stormwater, streets, traffic engineering, tree trimming, and Water operations and capital programming). The City Manager is also responsible for managing the contract services with the LA County Sheriff’s Department. Human Resources Filming Permits Recycling & Waste Collection Community Development Block Grant (CDBG) Lomita Housing Authority View Community Development Advisory Board Annual Meeting SB 272 – Enterprise System Community Survey Results Contact Us Call us: (310) 325-7110 Email us Our Location 24300 Narbonne Ave. Lomita, CA U.S.A. 90717 Council Appointed Officer Andrew Vialpando City Manager Bio",
    "depth": 4,
    "scraped_at": "2025-04-03 18:48:39"
  },
  "lomitacity.com_human-resources": {
    "url": "https://lomitacity.com/human-resources/",
    "title": "Human Resources - City of Lomita",
    "content": "Human Resources Melanie James 2024-11-04T15:47:07-08:00 Welcome to the Human Resources Division webpage! The Human Resources Division is responsible for overseeing recruitment and selection, employee benefits administration, employee training and development, employee relations, and risk management. The City does not discriminate on the basis of race, color, national origin, sex, age, or disability in its programs or activities. The Human Resource Manager is the city’s Civil Rights Coordinator. The City of Lomita complies with Government Code section 11135 and the implementing regulations (Cal. Code Regs, tit. 2, § 11140 et seq.), including, but not limited to, ensuring that no person is unlawfully denied full and equal access to the benefits of, or unlawfully subjected to discrimination in the operation of, City projectson the basis of sex, race, color, religion, ancestry, national origin, ethnic group identification, age, mental disability, physical disability, medical condition, genetic information, marital status, or sexual orientation as such terms are defined under California law. The City complies with the federal American with Disabilities Act of 1990 and implementing regulations as required by Government Code section 11135(b). The City does not unlawfully discriminate, harass, or allow harassment against any employee or applicant for employment because of sex, race, color, ancestry, religious creed, national origin, sexual orientation, physical disability (including HIV and AIDS), mental disability, medical condition (cancer), age (over 40), marital status, denial of family care leave, or genetic information, gender, gender identity, gender expression, or military and veteran status. The City ensures that the evaluation and treatment of their employees and applicants for employment are free from such discrimination and harassment. The City complies with the provisions of the Fair Employment and Housing Act and the applicable regulations promulgated thereunder. (Gov. Code, §12990, subds. (a)-(f) et seq.; Cal. Code Regs., tit. 2, § 7285 et seq.). Complaints shall be handled as required by State Law. For more information, please view the links below or contact us at (310) 325-7110 x144. City of Lomita & Careers Job Opportunities Job Descriptions City of Lomita Claim Form City Organizational Chart Compensation Information, Memoranda of Understanding (MOU), and Employment Contracts FY 2023-2024 Salary Schedule and Authorized Positions FY 2022-2023 Part Time Employee Compensation Plan MOU – Lomita City Employees Association, Administrative Services and Field Services Units Compensation Plan – Non-Represented Employees Current Openings Americans with Disabilities Act (ADA) In accordance with the requirements of Title II of the Americans with Disabilities Act of 1990 (“ADA”) and Section 504 of the Rehabilitation Act of 1973, the City of Lomita will not discriminate against qualified individuals with disabilities on the basis of disability in its services, programs, or activities. Notice Under the Americans with Disabilities Act ADA/Section 504 Complaint and Grievance Procedure ADA/Section 504 Grievance Form",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:44"
  },
  "lomitacity.com_filming-permits": {
    "url": "https://lomitacity.com/filming-permits/",
    "title": "Filming Permits - City of Lomita",
    "content": "Filming Permits Melanie James 2023-04-11T17:57:04-07:00 Filming Permit Process When submitting a Film Permit application, please make sure that it is accompanied by all requested documents as stated on the application. The application will be reviewed by the City, and depending on the size and overall demand that the production may require, the City will provide the applicant with a list of requirements that must be met in order for a film permit to be issued. This may include having LA County Sheriff or Fire personnel present, surveying affected residents and/or businesses for approval, posting of parking signs, etc. Once all requirements have been met, the City may approve the application, provide an agreement with the Terms & Conditions and issue the film permit. Currently, the film permit application fee is $182.75, and is subject to a business license fee based on the number of days of filming. Business license fees are collected on filming days as well as set-up and tear down days. Additional fees may also be imposed by the City for the posting of signs, and for clean-up of the filming site, if necessary. To ensure that there is adequate time to review such requests, the City asks that applications be submitted at least two weeks prior to the date of production. For further information, please contact us at (310) 325-7110 ext. 120. Film Permit Application Filming Survey",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:48"
  },
  "lomitacity.com_recycling-waste-collection": {
    "url": "https://lomitacity.com/recycling-waste-collection/",
    "title": "Recycling & Waste Collection - City of Lomita",
    "content": "Recycling & Waste Collection Melanie James 2024-08-14T11:48:58-07:00 This section provides care for the enhancement of environmental resources of the community. The main functions of this section include residential collection services for solid waste, recycling and yard waste through exclusive franchise. Additionally, this section provides information to residents and businesses on waste reduction, and backyard composting. Provides educational information on environmental issues to the citizens, schools and businesses. The current programs operated under this section are: Solid Waste Collection Recycling – Residential Curbside Holiday Trash Collection Bulky Item Collection Holiday Tree Collection Hazardous Materials – Disposal Hazardous Materials – Spill or Release Recycling Centers Composting Solid Waste Collection Weekly curbside refuse collection for all single-family, multi-family dwellings and commercial customers (utilizing roll-off collection services) is provided through Athens Services, the city’s franchised residential trash hauler. Because pickup of trash is automated, refuse is collected only in the containers provided to the residents by Athens Services. Containers to be serviced must be placed curbside by 7:00 a.m. on your scheduled pick-up day. Each resident is supplied with a set of three color-coded containers. The blue container marked “Recyclables Only” is to be used only for the following items: cardboard, paper, metal, glass, and plastic containers (See “Recycling” below). The green container marked “Yard Waste Only” is to be used only for the following items: grass, leaves, bush & hedge trimmings, and tree trimmings under 4 feet long and 4 inches in diameter. Please do not deposit palm fronds, ice plant, tree fruit or other refuse in the green containers. Bundled yard trimmings (not to exceed 4 feet in length) may also be collected as a Bulky Item. The gray container marked “Refuse Only” is for non-recyclable trash. Any item not on the accepted list for the Recyclables or Yard Waste containers should be placed in the gray container. Additional containers may be obtained by calling Athens Services at 888-336-6100. Items such as dirt, brick, block and concrete should not be mixed in with regular refuse. This is construction debris, and requires a special pickup. Also, large bulky items such as furniture, appliances and bundled yard trimmings require a special pickup. Residents should call Athens Services at 888-336-6100 to make arrangements for these collections. Residents are reminded that hazardous material such as paint, motor oil, pesticides and chemicals must not be placed in trash containers. For further information or questions, you may contact Athens Services at the number above. Access the AB 341 and SB 1383 Waiver Request Form Recycling - Residential Curbside As part of the residential trash collection service, every customer is supplied with a blue automated recycling container to collect the following recyclable items: aluminum cans, aluminum foil, metal coat hangers, empty aerosol containers, all plastic containers, and clear/brown/green glass bottles and jars with the lids removed. No Styrofoam, Please You may also include paper items such as newspaper, magazines and catalogs, telephone books, cardboard, cardboard 12-pack soda cartons, cereal boxes with the wax paper removed, food boxes such as cake mixes, crackers, etc., tissue boxes, pizza boxes, cardboard egg cartons, junk mail, white and colored ledger paper, computer paper, and envelopes. The blue container is intended to be used exclusively for the recyclable materials listed above. On the morning of your regular trash collection day, place the blue recycling container along with your green waste and regular trash containers curbside by 7:00 a.m. If you would like further information about the residential recycling program or have a concern about your service, you may call Athens Services at 888-336-6100. Holiday Trash Collection On the listed holidays, which are observed by the City’s refuse hauler, Athens Services, there will be NO residential trash, recycling or yard waste pick-up. The holiday listing can be found here: https://athensservices.com/ufaqs/what-is-the-holiday-schedule/ Solid Waste will be collected the day AFTER the normal collection day for the remainder of the week. For example, Friday’s trash will be collected on Saturday. The regular schedule will then resume the following Monday. If you have a question concerning service or the holiday collection schedule, please call Athens Services at 888-336-6100. Bulky Item Collection All single family customers with residential curbside collection are eligible to receive free, on-call, pick-up for bulky items up to 4 times per calendar year (up to 6 items per pickup) that cannot be accommodated in the automated containers. Bulky items include, but are not limited to, refrigerators, stoves, washers, dryers, hot water heaters, electronics, mattresses, furniture, and bundled yard trimmings (not to exceed 4 feet in length). Multi-Family customers are eligible to receive free, on-call, pick-up for bulky items once per calendar year (up to 6 items per pickup) that cannot be accommodated in the automated containers. Bulky items will be collected on the residents’ regular collection day, and residents must call Athens Services at 888-336-6100 at least one day prior to their collection day to schedule this special pick-up. Holiday Tree Collection The City through its franchised trash hauler, Athens Services, provides a holiday tree collection service for homes with residential curbside collection. Collection of trees will occur on your regular trash collection day for the two weeks following Christmas Day. The trees will be ground up for composting or used for the County Sanitation Districts’ landfill Cover Project, and thus diverted from disposal as regular trash. Residents should place their holiday trees at the curb or alley by 7:00 AM on their regular refuse collection day during that period. All decorations must be removed. Flocked trees are acceptable. Trees over four feet tall should be cut in half. All tree stands must be removed. Please do not place your tree in a plastic bag. Multi-Family Residential units may call Athens Services at 888-336-6100 for FREE pick-up of holiday trees. Hazardous Materials - Spill or Release If a release of known or suspected hazardous materials is observed, call 911. Stay away from the material, and keep others away. Allow only trained personnel to respond to this type of situation. Recycling Centers For a list of area recycling centers, please refer to your local telephone directory or www.earth911.com. Several local grocery stores also have recycling centers located in their parking lots. For more detailed information about recycling, call the California Recycling Hotline at 1-800-RECYCLE (800-732-9253). Several local grocery stores also have recycling centers located in their parking lots. For more detailed information about recycling, call the California Recycling Hotline at 1-800-RECYCLE (800-732-9253). Several local grocery stores also have recycling centers located in their parking lots. For more detailed information about recycling, call the California Recycling Hotline at 1-800-RECYCLE (800-732-9253). Composting Composting is an excellent way to use yard waste as a valuable resource. Leaves, grass clippings, and the remains of garden plants and selected food scraps make good compost. The dark, crumbly organic matter from your compost pile can be used to enrich the soil in the garden as well as for houseplants and planters. For more information about how to compost, composting workshops, or purchasing a composting bin or instruction book, visit www.smartgardening.com . Agreement for Solid Waste Collection Service To view the City’s agreement for Solid Waste Collection Service please click here . To view the City’s First Amendment to the agreement for Solid Waste Collection Service please click here . Solid Waste Rates To view the current and upcoming Solid Waste Rates please click here .",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:53"
  },
  "lomitacity.com_cdbg": {
    "url": "https://lomitacity.com/cdbg/",
    "title": "Community Development Block Grant (CDBG) - City of Lomita",
    "content": "Community Development Block Grant (CDBG) Melanie James 2023-06-29T00:15:31-07:00 Residential Rehabilitation Program The purpose of the Residential Grant Program is to preserve the City’s residential neighborhoods by assisting property owners to improve their residential property. Homes must be owner occupied and be within the income guidelines to qualify for the program. Eligible home improvements include, but are not limited to: house painting, flooring, hazardous interior conditions (electrical, plumbing, structural), walls and fencing, garage repairs, roofing, driveway repairs, exterior siding, plastering and stucco, and the correction of code violations. Work is completed by state licensed contractors through the Community Services staff. Grant Program Direct assistance of a one time grant per program year will be provided to owner occupied households for home repairs and improvement costs to a maximum of $15,000 for single family homes and mobile homes within the proper City of Lomita boundaries for: Correction of code violations first; and once code violations are corrected, Imminent code violations must be completed secondarily; and, upon elimination of any and all code violations and imminent code violations, CDBG eligible general property improvements may be considered by staff for the scope of work on the project. Applicants for the Grant Program with properties outside the Community Development Commission’s (CDC) approved slum/blight target area must be within the “Extremely Low” or “Low” income maximums. Those within the Development Commission’s (CDC) approved slum/blight target area can be within the “Extremely Low” “Low” or “Moderate” income maximums. The program is administered with Community Development Block Grant (CDBG) funding. Due to the limited funding available each year, new applicants will be placed on a wait list. When funds become available, eligible applicants will be sent an application and be requested to provide the required documents to determine eligibility. All eligible applicants can qualify based upon family size, and the corresponding maximum gross income of 80% of the Los Angeles County Median Income. For more information about the program, please contact us at (310) 325-7110 ext. 107. Lifeline Personal Response System The City of Lomita offers the Lifeline Personal Response System (LIFELINE) on a grant basis to elderly (55 or older) and/or disabled persons with serious health problems who reside within the City. Assistance is available 24 hours a day in conjunction with Lifeline Central Monitoring Services. How Lifeline Works A Lifeline subscriber can summon immediate assistance simply by pressing a small transmitter button that can be worn like a pendant or a watch. When the Lifeline button is pushed, a signal is sent to the Response Center. The Response staff member will call the subscriber’s telephone number and if there is no answer, a staff member will be dispatched to the subscriber’s home. If you are interested in the program or would like to be put on the waiting list, please contact us at (310) 325-7110 ext. 107. Lomita Job Creation and Business Incentive Loan Program The Lomita Job Creation and Business Incentive Loan Program (JCBI) is designed to assist local businesses and create new jobs. The City of Lomita through the use of a portion of its annual Community Development Block Grant (CDBG) funding may provide loans up to $70,000 available to businesses creating permanent jobs. In addition to the criteria listed in the program guidelines, jobs provided must be permanent full-time (FTE) equivalent positions made available to low income households. While it is technically a loan program, the loan may be forgiven if the applicant has maintained compliance with the Program Guidelines during the one-year loan term. JCBI Program Guidelines JCBI Application Packet If you have questions regarding the program, please contact us at (310) 325-7110 ext. 107.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:48:58"
  },
  "lomitacity.com_wp-content_uploads_2023_10_2024-SB272-Enterprise-updated-for-website-final.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/10/2024-SB272-Enterprise-updated-for-website-final.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/10/2024-SB272-Enterprise-updated-for-website-final.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:08"
  },
  "lomitacity.com_community-survey-results": {
    "url": "https://lomitacity.com/community-survey-results/",
    "title": "Community Survey Results - City of Lomita",
    "content": "Community Survey Results Kendall Lowery 2024-06-06T14:29:45-07:00 Periodically, the City conducts a community survey which serves as a tool to assist the City Council in setting priorities, evaluating community needs and establishing goals to improve service. It is important for the City to know how residents feel about the quality of everything from facilities and programs to events and services. The goal of the survey was to assess resident opinions, priorities and satisfaction levels with City core services and communication efforts, as well as community characteristics that contribute to quality of life. To conduct this survey, the City contracted with FM3, an independent survey research firm that used a random sampling methodology to obtain a statistically valid, demographically representative sample based on the latest Census data. FM3 used a combination of emails, postcards, texts and phone calls to recruit participation in the survey from the randomly selected residents, with respondents given the option to complete the survey online or by telephone. A total of 467 surveys were completed, exceeding the initial goal of 400 surveys. The results of this community survey will be used by the City in strategic planning and budgeting decisions and communication and engagement efforts, and provides an ongoing baseline for subsequent surveys. Going forward, the City plans to conduct the survey every few years to track and measure improvements and identify shifts in community priorities and concerns. 2023 Community Survey Survey Presentation (PDF) 2018 Community Survey Survey Presentation (PDF)",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:14"
  },
  "lomitacity.com_community-economic-development": {
    "url": "https://lomitacity.com/community-economic-development/",
    "title": "Community & Economic Development - City of Lomita",
    "content": "Community & Economic Development Sara Madsen 2025-03-18T21:14:47-07:00 The Community & Economic Development Department exists to enhance the community’s safety, welfare, economic opportunities and quality of life. Planning Division (310) 325-7110 | dutyplanner@lomitacity.com We assist our residents and the general public with any inquiries related to zoning and land use at the Planning Counter during normal counter hours or via emails or phone calls. We also process development and land use applications such as new development, subdivisions, conditional use permits and small additions, and write staff reports for discretionary requests that require Planning Commission or City Council approval. We draft new zoning codes and prepare amendments to the General Plan. Building and Safety Division 24320 S. Narbonne Ave., Lomita, CA 90717 | (310) 534-3760 The Building Safety Division reviews and verifies that construction projects are consistent with the Los Angeles County Building Code. The City has a contract with the Los Angeles County, Building and Safety Division for building plan check, permit issuance and building inspections. Code Enforcement Division 310-325-7110 x 156 | code@lomitacity.com The Code Enforcement Division assists our residents in achieving code compliance. We take calls from concerned neighbors regarding unauthorized construction or other work performed out of compliance with the City’s Municipal Code. Economic Development We are committed to driving a vital and competitive economy that increases prosperity and quality of life for our residents and businesses. We assist in any way we can to achieve a more economically vibrant community. Contact Us Call us: (310) 325-7110 Email us Our Location 24300 Narbonne Ave. Lomita, CA U.S.A. 90717 Department Head Adrian Fernandez Community & Economic Development Director We would love to hear from you! Walk-in Planning Counter Hours are 8:00 AM to 10:00AM and 2:00PM to 4:00 PM Monday through Thursday. Accommodations outside these hours can be made by appointment. For general planning inquiries dial 310-325-7110 or email the duty planner dutyplanner@lomitacity.com For code enforcement requests dial 310-325-7110 x 156 For building and safety related questions please call the Lomita Office of Los Angeles County Building and Safety at 310-534-3760",
    "depth": 4,
    "scraped_at": "2025-04-03 18:49:19"
  },
  "lomitacity.com_planning-division": {
    "url": "https://lomitacity.com/planning-division/",
    "title": "Planning Division - City of Lomita",
    "content": "Planning Division Sara Madsen 2025-03-18T20:48:04-07:00 The Planning Division meets with our residents and the general public at the public counter to review design and development standards that apply to the physical environment and land use. We assist residents, architects, designers, developers and builders in processing applications for new construction on land uses. We also work on policy and new code requirements to make Lomita a better place for our residents. Municipal Code Online Downtown Design Guidelines Zoning Map General Plan Map The Planning Division processes the following applications: Site Plan Review Conditional Use Permits General Plan Amendments Variances Subdivision of Land Sign Review Review for compliance with Zoning Home-Based Business Permits Residential Property Reports How can I apply for a solar roof mount permit? Starting September 30, 2024, residents can apply for an express solar roof mount permit through Los Angeles County. Applications are processed through the Los Angeles County system, EPIC-LA . These permits are only issued for eligible residential solar systems that do not require additional permits (such as for a service panel upgrade or re-roof). How to Use the LA County System for Solar Permits: Visit the Los Angeles County EPIC-LA Portal . Enter “ Lomita ” in the search bar at the top of the page to view permits specifically for Lomita. Choose one of two options: Express Solar Roof Mount Residential Express Solar Roof Mount Residential with Energy Storage System Click the blue “apply” button, log in or create an account and follow the instructions to complete your application. Contact Us Call us: (310) 325-7110 ext. 103 Email us Our Location 24300 Narbonne Ave. Lomita, CA U.S.A. 90717 Hours of Operation 7:30AM – NOON 1:00PM – 5:30PM Monday – Friday (Closed every other Friday) Planning Division Counter Hours 8AM-10AM and 2PM-4PM Planning Process Review The Purpose of this guide is to prepare project proponents for the review and processing of various development applications within the City of Lomita. It is made available to the public for reference, as a summary of code requirements and explanation of planning terms and processes. The information provided herein is consistent with the General Plan of the City of Lomita, the current Zoning Code, the California State Subdivision Map Act, and all other applicable state, county and local ordinances, policies and regulations. Review Process Ministerial Approval: Staff Review Prior to obtaining a building permit, projects that entail construction or modifications to existing structures, including construction of fences, new windows, and solar installations, must undergo an administrative (staff level) site plan review to verify the project’s compliance with the City’s required development standards. A member of the Planning Division staff will be assigned as the case planner for the project upon an application’s submission. The case planner will review the project for compliance with applicable development standards and will collect an administrative review fee from the applicant; the review fee is waived for solar panel projects. Projects that require minor corrections will be provided a list of revisions necessary to make the project code compliant. The applicant will be issued an approval letter once any necessary revisions are made and the case planner determines that the project adheres to all applicable development standards. The planner will also stamp plans submitted with the application. Upon receiving administrative approval the applicant must submit two complete sets of plans to the Los Angeles County Department of Building and Safety for plan check. A complete set of plans includes a site plan, structural plan, floor plans, and elevations. Building and Safety staff will inform the applicant if additional plans or sets of plans are required. Plan check fees are collected at the time of submission and are based on the valuation of the project, but include school tax and other fees. Plans are reviewed for expansive soil conditions, seismic resistance requirements, and energy saving measures, as well as other Building and Safety requirements. After any required modifications to the plans are made; a building permit is issued. Discretionary Approval: Planning Commission Review If the administrative review shows that a project does not meet code requirements or requires discretionary review per the Lomita Zoning Code, the project will need entitlement approval from the Planning Commission and possibly the City Council depending on the entitlement(s) requested prior to obtaining a building permit. Planning Commission approval is also required for discretionary planning applications, including but not limited to; zone change, and conditional use permit applications. A member of the Planning Division staff will be assigned as the case planner for the project. The case planner will provide the applicant a list of required supplemental materials be submitted with their application, such as plans, elevations, site surveys, etc. After an application is determined complete for processing, the case planner will prepare and present a report to the Commission recommending approval or denial of the project. Planning Commission Hearing A public hearing requires notification of surrounding property owners and allows for opposing arguments to be heard. The procedures necessary to schedule a public hearing are detailed in the appropriate instructions. The Lomita Planning Commission meets on the second Monday of each month. Plans must be deemed complete by the assigned case planner prior to scheduling the item to appear before the Planning Commission. After the case planner presents the project’s staff report, the applicant, as well anyone in attendance at the hearing, will be given the opportunity to address the Commission regarding the project. The Planning Commission may then approve, approve with conditions, or deny the proposed project. For approvals such as tentative maps and legislative amendments, the Planning Commission will make a recommendation to the City Council for final approval, approval with conditions, or denial. City Council Hearing Certain types of development applications, appeals, and General Plan and Zoning Code updates require a City Council hearing. A City Council decision is final. Handouts/Submittal Requirements The Planning Division can now process minor permits and approvals online through ViewPoint . Planning Department Handouts/Submittal Requirements Subdivision Application Requirements Landscape Plans and MWELO Submittal Requirements Height Variation Permit Application Requirements Planning Fees – Effective April 6, 2024 Summary of Development Impact Fees Water Conservation Form Waste Hauling Customer Acknowledgement Form Fence Standards Municipal NPDES Requirements The How-to of Commercial Tennant Improvements Drought-Tolerant Landscaping Additional Information/Handouts The Planning Division publishes helpful flyer cards on a variety of topics: Where can I find the requirements to open and operate a business? Visit the CalGold website to find appropriate permit information for your business. This resource provides contact information for various agencies that administer and issue permits, including cities, counties, and other relevant departments. https://www.calgold.ca.gov/ Where can I find tax resources for my business? The California Department of Tax and Fee Administration has a website that features information on the programs they administer, how to register for permits and licenses, and how to file and report correctly. https://cdtfa.ca.gov/ What are some examples of drought-tolerant landscaping in Lomita? Page 1 / 1 Zoom 100% Page 1 / 1 Zoom 100% Lomita Zoning Code Lomita Zoning Map For details, exceptions, and other requirements, contact the City of Lomita Community and Economic Development Department at 310-325-7110, extension 122.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:25"
  },
  "lomitacity.com_building-and-safety-division": {
    "url": "https://lomitacity.com/building-and-safety-division/",
    "title": "Building and Safety Division - City of Lomita",
    "content": "Building and Safety Division Kendall Lowery 2025-03-18T21:12:21-07:00 Los Angeles County Building and Safety, managed by LA County Public Works, has been providing services to ensure safe building design, construction, approval of completed building projects and providing code enforcement since the adoption of County building codes and standards in March 1933. Building services are provided to unincorporated communities at the Public Works headquarters, at one of the 10 Building and Safety District Offices serving unincorporated communities and at the 10 Contract City Offices serving incorporated cities. These offices are staffed by highly professional, knowledgeable and customer service-oriented staff. Building and Safety provides building permits, review and monitoring of the design, construction, installation, demolition, and maintenance of privately-owned buildings and structures through the enforcement of the County’s building codes and regulations. To get started in obtaining permits, please follow these steps: Create an account on Los Angeles County, Building and Safety Online Portal (if the link isn’t functional, search “LA County BSOP”) Enter the property address of the location where work is to be done in the search box at the top left of the page. It will take you through a couple of different screens before it prompts you to log in/create an account. Apply for a building permit, fill in all information and upload plans (if applicable) directly to the project that you applied for in BSOP (it’s a part of the process; it’ll prompt you to upload the plans). If any mechanical, electrical or plumbing work is requested (even if it’s removing a fixture and then putting the same one back in the same place) a permit for the relevant trade must be applied for through BSOP so that it can be screened and, if needed, go through plan check as well. After you request a permit, the County process is as follows: Screening: estimated 2-3 weeks After screening is complete, you will be prompted to pay the “Plan Review Fees” (not the issuance fees, just the plan check fees) for the process to move to the next step (plan review). Plan review: estimated 6-8 weeks *Please note that these are our best estimates in regards to the timeframes After plan review is complete, you’ll either receive comments from your plan reviewer or you will receive approval and an email from one of the three permit technicians with the issuance fee amount and the additional documentation required to issue the permit (please wait for an email from one of the permit techs as it will have the next steps). When revisions to the plans based on the corrections have been completed, you will then upload the revisions and response letter directly to the project in our online system. At that point, you can reach out to your plan reviewer, who will be able to give you an estimated timeframe for rechecking.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:30"
  },
  "lomitacity.com_code-enforcement": {
    "url": "https://lomitacity.com/code-enforcement/",
    "title": "Code Enforcement - City of Lomita",
    "content": "Code Enforcement Sara Madsen 2023-08-22T23:32:57-07:00 The Code Enforcement Division of the Community & Economic Development Department is responsible for enforcing provisions of the Lomita Municipal Code involving quality of life and neighborhood quality issues such as: Junk, Debris, Garbage Illegal or Unpermitted Signs Business License Enforcement Illegal or Unpermitted Construction Weed Abatement Graffiti Removal Inoperable/Abandoned Vehicles Zoning Violations Code enforcement staff also coordinates the City’s activities with the health, animal control, building rehabilitation, police and fire suppression agencies. Compliance The Code Enforcement Team generally works under a model of voluntary compliance and works with property owners to correct violations within reasonable time allowed to meet compliance. In certain circumstances, administrative penalties are assessed to those who fail to comply with the Municipal Code or who fail to take remedial actions. Payment Payments can be made by visiting http://citationprocessingcenter.com or by calling (800) 969-6158. Payments will NOT be accepted at City Hall. Appeal Any recipient of an administrative citation may contest the violation(s) by filing an initial admisntrative review within 15 calendar days of issuance of the citation by submitting a request through http://citationprocessingcenter.com . This request must be made online or over the phone to (800) 969-6158 and set forth with particularity the reasons the responsible person was not responsible for the violation(s). A request for an initial admisntrative review is a mandatory prerequisite to a request for an administrative hearing requiring an advance payment of the fine as well ass associated fees. Lomita Municipal Code How to Report an Issue Public inquiries, issue reports, or comments can be sent to code@lomitacity.com or by calling 310-325-7110, extension 156. The Code Enforcement Division can also process code enforcement requests regarding code violations online through ViewPoint. Viewpoint is a website that allows residents to report and view neighborhood concerns. Citizens may photograph a concern and report it through the website. A copy of the photo, description of the issue by the reporting party, and the location will go directly to Code Enforcement for review. In the event of an emergency, please call 911. Calls to this department about possible violations are kept confidential and files are not released to the public unless required by court order.",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:36"
  },
  "lomitacity.com_code-enforcement_graffiti": {
    "url": "https://lomitacity.com/code-enforcement/graffiti/",
    "title": "Graffiti - City of Lomita",
    "content": "Graffiti Kendall Lowery 2024-01-23T17:16:02-08:00 New 3-Brushed Approach to Graffiti Abatement in Lomita The City of Lomita is dedicated to the improvement of our community through measures that combat vandalism while also promoting artistic expression and beauty. Our city features many large, blank walls, or “blank canvases”, that can be enticing to vandals. Visible signs of disorder such as graffiti within a community may perpetuate and exacerbate harmful conduct. More formal covering of “blank canvases” through design strategies such as murals can help to ensure that we are not only ridding our city of graffiti, but also promoting beauty through creative expression. In order to ensure that we are striving towards this mission, we have developed a “3-Brushed” approach to protect your “blank canvas” from graffiti: Cover Your Canvas [ideas for property owners to prevent graffiti] Graffiti-resistant coating: Various types of coatings chemically designed to protect surfaces from graffiti are available for purchase at hardware stores, home improvement stores, and Amazon. Install lighting: Proper lighting can deter graffiti artists as it may be easier to complete a tagging in a poorly lit area. Install security cameras: Security cameras may help to identify vandals, which decreases the likelihood of future graffiti. Buffer physical access to the canvas with landscaping: Enhance your property with natural beauty such as bushes, hedges, and/or flowers near walls to create a physical buffer that inhibits artist access. Plant trees: Planting trees in front of blank walls can make it more difficult to access and tag walls. Trees also limit visibility of any tagging on the walls, making the location less desired by graffiti artists. Cover with wall vegetation: Ivy and other similar vegetation can physically prevent graffiti as it creates a natural plant barrier on the surface of the wall while also adding to aesthetic. Add lattice or replace with a perforated design : Graffiti artists typically tag flat, seamless surfaces, so consider adding lattice work or a perforated design for enhanced dimension. This may include decorative punch-outs in walls or an additional perforated layer fastened to the wall. Repaint with a multicolor pattern or mural: Graffiti is more visible when a wall is painted using one color, so it is best to include patterns with diverse and alternating colors to deter tagging. Murals are permitted and encouraged within Lomita with Planning Commission approval. Look for a few popping up this winter and spring around Downtown Lomita! Please reach out to the Lomita Planning Division for more information at dutyplanner@lomitacity.com or 310-325-7110.  Staff is working on a resolution to reduce fees associated with mural approvals to be considered by City Council in early 2024. Care For Your Canvas [graffiti-related laws and measures available for its removal] Lomita Municipal Code maintains measures to protect all properties and prevent future graffiti.  You may report the identification of a code violation to code@lomitacity.com by phone at 310-325-7110, extension 156. Penalty : Any person who writes, sprays, scratches, or otherwise affixes graffiti on any real or personal property not his or her own is guilty of an infraction. Graffiti & Minors : No person shall sell or give to a minor any aerosol container that is capable of defacing property. No minor shall purchase an aerosol container of paint that is capable of defacing property. No minor shall possess an aerosol container for the purpose of defacing property while upon any public place. No person, other than a parent or legal guardian, shall furnish a graffiti implement to a minor. Required Signage : Businesses offering aerosol paint containers must post a sign stating: “Any person who maliciously defaces real or personal property with paint is guilty of vandalism which is punishable by fine, imprisonment or both.” Graffiti-Related Materials : No person shall carry an aerosol container of paint while in any posted public facility. Graffiti Removal: Owners shall remove graffiti from private property within the amount of days indicated by notice, otherwise Code Enforcement must proceed with citations. Permissive Removal: If a property owner consents, the City may remove graffiti on behalf of the property owner subject to a fee. This form will soon be available on this webpage. Public Nuisance: If a property owner fails to remove graffiti or elect for Permissive Removal, the site may be declared a Public Nuisance, forcing removal. Common Canvas: [education & artistic expression in real life!] Coming soon! City Staff has partnered with a local muralist to educate our youth regarding graffiti and is conducting a mural competition! The City recognizes that graffiti is often the product of not having a proper creative outlet. Through teaching students about the dangers of graffiti and providing them with the tools to beautify our city, we hope to prevent future vandalism. The mural will be unveiled in a location at Lomita Park as part of the Anti-Gang and Drug Free Walk early this summer.",
    "depth": 4,
    "scraped_at": "2025-04-03 18:49:41"
  },
  "lomitacity.com_online-permitting": {
    "url": "https://lomitacity.com/online-permitting/",
    "title": "Online Permitting - City of Lomita",
    "content": "Online Permitting Sara Madsen 2023-11-07T09:52:34-08:00 You can now process several planning permits and report various code violations online through the Community & Economic Development Department’s new online permit software: ViewPoint Cloud. This new system allows applicants to submit an application and payment from anywhere 24/7, monitor the status of the application online, and to receive notifications via email as the application is reviewed and processed. The following Planning applications can be submitted online: Administrative Approvals Temporary Banner Permits Film Permits Residential Property Reports Special Event Permits Block Party Permits Contractor Self-Haul Construction Waste Permit",
    "depth": 4,
    "scraped_at": "2025-04-03 18:49:46"
  },
  "lomitacity.com_city-of-lomita-housing-resources": {
    "url": "https://lomitacity.com/city-of-lomita-housing-resources/",
    "title": "Housing Resources - City of Lomita",
    "content": "Housing Resources Janpier Adamzadeh 2023-08-24T23:35:58-07:00 The City of Lomita has a new housing resources webpage! Check out information related to accessibility, homebuyer assistance programs, Section 8, fair housing, and energy conservation. City of Lomita Housing Resources Download PDF Here LA County Housing Resources Los Angeles County Consumer and Business Affairs Stay Housed LA What you should know about setback requirements in A1 and R1 zones? Maximum Height: 27′ House, not exceeding 2 stories, except south of Pacific Coast Highway 16′ House, south of Pacific Coast Highway 16′ Accessory building and structure, not exceeding one story Floor Area Ratio (FAR) controls the bulk of a building. It is calculated by the gross square footage of all the buildings and/or structure on a lot divided by the lot area. FAR = GROSS SQUARE FOOTAGE (sq. ft.) / LOT AREA (sq. ft.) Maximum FAR = .60 includes all bldgs. on a lot Example of a Typical Lot: For details, exceptions and other requirements, contact the City of Lomita Planning Dept. at 310-325-7110. JCM: 7/93 What you should know before you build a new fence or wall? For residential fence height requirements, please refer to the City of Lomita’s Municipal Code Section 11-1.30.07. For nonresidential fence height requirements, please refer to the City of Lomita’s Municipal Code Section 11-1.68.02 . What you should know about home businesses? Home Occupation Located in Residential Zone A resident may conduct a business out of a home in residential zones provided that such business does not change the character of the residential use. Typical allowed home occupations include an office use, tax preparation, and clothing alteration. A Home Occupation License must be obtained and the license fee is based on gross annual receipts. The following criteria and conditions must be met: Only family members who live on the premises may help with the business; Total area of the business shall not exceed one room or 400 sq. ft. of the house; No outdoor storage is allowed; The business shall not occupy the required parking spaces in a garage and must comply with off-street parking requirements; Only vehicles registered to the occupants and normally used for personal purposes shall be kept on the premises; No pedestrian or vehicular traffic can be generated; Use of utilities, community facilities and services shall not exceed normal household use; Only those materials and mechanical equipment normally used in a household is permitted; No business signs are permitted; and The residential appearance of the house must be maintained. Residential Use Located in Non-Residential Zone A home occupation conducted out of a residential use in a non-residential zone may be permitted with the City Administrator’s approval only. For details, exceptions and other requirements, contact the City of Lomita Planning Dept. at 310-325-7110. What you should know before you add a second unit or ADU? Accessory Dwelling Units What you should know about height and bulk requirements in A-1 and R-1 zones? Maximum Height: 27′ House, not exceeding 2 stories, except south of Pacific Coast Highway 16′ House, south of Pacific Coast Highway 16′ Accessory building and structure, not exceeding one story Floor Area Ratio (FAR) controls the bulk of a building. It is calculated by the gross square footage of all the buildings and/or structure on a lot divided by the lot area. FAR = GROSS SQUARE FOOTAGE (sq. ft.) / LOT AREA (sq. ft.) Maximum FAR = .60 includes all bldgs. on a lot Example of a Typical Lot: For details, exceptions and other requirements, contact the City of Lomita Planning Dept. at 310-325-7110.",
    "depth": 4,
    "scraped_at": "2025-04-03 18:49:52"
  },
  "lomitacity.com_author_lomitajanpier": {
    "url": "https://lomitacity.com/author/lomitajanpier/",
    "title": "Janpier Adamzadeh - City of Lomita",
    "content": "About Janpier Adamzadeh This author has not yet filled in any details. So far Janpier Adamzadeh has created 12 blog entries. City of Lomita 60th Anniversary Calendar City of Lomita Hiring: Public Works Director Apply Here Public Notice of Commission Vacancies Download Application Here Passing of Lomita’s CORE Deputy Okamoto The City of Lomita would like [...] March 30, 2024: Vista Verde Fire at 2110 Palos Verdes Drive North This page will be regularly updated. On March 30, [...] Resources for Unhoused Persons https://lomitacity.com/resources-for-unhoused-persons/ Lomita State of the City 2023 Replay Lomita State of the City Event 2023 - YouTube National Voter Registration Day It's National Voter Registration Day! Take 30 seconds to register [...] 14th Annual Golf Classic & Mayor’s Cup To register for the event [...] Fireworks Prohibited in Lomita $1000 Fine 1 2 Next",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:56"
  },
  "lomitacity.com_wp-content_uploads_2023_01_City-of-Lomita-Housing-Resources-5.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2023/01/City-of-Lomita-Housing-Resources-5.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2023/01/City-of-Lomita-Housing-Resources-5.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:49:59"
  },
  "lomitacity.com_accessory-dwelling-units": {
    "url": "https://lomitacity.com/accessory-dwelling-units/",
    "title": "Accessory Dwelling Units - City of Lomita",
    "content": "Accessory Dwelling Units Janpier Adamzadeh 2023-10-24T23:38:22-07:00 Number of Allowable ADUs or JADUs Updated July 24, 2023 per Ordinance No. 854 For lots with an existing or proposed single-family dwelling, 1 accessory dwelling unit and 1 junior accessory dwelling unit shall be allowed on a lot. For lots with an existing or proposed multifamily residential dwelling structure: No more than 25% of the number of the existing units , but at least 1 unit , shall be permitted as ADUs constructed within the non-livable space and are enclosed on at least 3 sides (e.g., storage rooms, boiler rooms, attics, basements, or garages) of the existing multifamily dwelling structure provided that applicable building codes are met; Fractions shall be rounded down to the next lower number of dwelling units, except that at least 1 accessory dwelling unit shall be allowed. Up to 2 accessory dwelling units shall be permitted as detached from the multifamily residential structure and may be attached or detached to each other. ADU Definitions Updated July 24, 2023 per Ordinance No. 854 (1) Accessory dwelling unit/ADU has the same meaning as that stated in Government Code Section 65852.2 as that section may be amended from time to time. (2) Attached or Attached ADU means an ADU that shares at least one common wall with the primary dwelling unit. (3) Converted ADU means an ADU that is constructed within all or a portion of the legally permitted existing interior space of an accessory structure or within all or a portion of the permitted existing interior space of a dwelling structure, including bedrooms, attached garages, and storage areas. (4) Detached or Detached ADU means an ADU that is physically separated from, but located on the same lot as, a primary dwelling unit. (5) Existing . A structure is “existing” if it was legally constructed, and the construction has passed all required final inspections. (6) Junior accessory dwelling unit/JADU is a unit no more than 500 square feet in size and contained entirely within a proposed or existing single-family dwelling or within the walls of a garage attached to an existing single-family dwelling. It shall include permanent provisions for living, sleeping, eating, and cooking. (7) Public transit has the same meaning as that stated in Government Code Section 65852.2 as that section may be amended from time to time. (8) Floor area of an accessory dwelling unit means, for the purpose of this section, the area of each floor level included within the walls enclosing each dwelling unit. The floor area shall be measured from the outside face of the walls enclosing each dwelling unit including all closet space and storage areas contained within the unit, including habitable basements and attics, but not including unenclosed porches, balconies, or any enclosed garages or carports. For purposes of calculating allowable floor area of accessory dwelling units based on a proportion of the size of the primary residence, only the livable floor area of the primary residence shall be counted. The floor area of any other structures, for purposes of calculating total floor area, lot coverage, or other calculations, shall be calculated in the manner described in the relevant zoning regulations. Type 1: Converted JADU Entirely Within Space of Existing Primary Dwelling on a Single-Family Lot Type 2: Converted ADU Entirely Within Existing Primary or Accessory Structure on a Single-Family Lot Type 3: New Construction ADU Attached to Primary Dwelling on a Single-Family Lot Type 4: New Construction Detached ADU on a Single Family Lot Type 5: Converted ADU Within Existing Space of a Multifamily Structure Type 6: New Construction Detached ADU on a Multifamily Lot ADU Type Comparison Chart ADU Design Checklist Requirements for ADU Rentals and Sales Updated July 24, 2023 per Ordinance No. 854 Cannot be sold, or title transferred separate and apart from the remainder of the property, except as provided in Section 65852.26 of the Government Code Restricted to the floor area and height allowed per the development standards of the time Owner-occupancy requirement must be consistent with California Government Code Sec. 65852.2. If the state allows the city to require owner-occupancy, the ADU shall be considered legal only so long as the owner resides at the property built with the ADU. Not to be operated as a short-term rental or rented for a period less than 30 days Restrictions binding upon any successor in ownership of the property",
    "depth": 5,
    "scraped_at": "2025-04-03 18:50:04"
  },
  "lomitacity.com_city-attorney": {
    "url": "https://lomitacity.com/city-attorney/",
    "title": "Office of the City Attorney - City of Lomita",
    "content": "Office of the City Attorney Melanie Moore 2021-11-09T23:13:35-08:00 Trevor Rusin with Best, Best and Krieger serves as the City Attorney for the City of Lomita.  Trevor was appointed as the City Attorney in 2021. The City Attorney provides legal counsel to the City Council, the City Manager, and the various City departments, represents the City in litigation or to manage outside counsel representing the City in litigation, helps the City avoid litigation whenever possible, drafts ordinances and resolutions, prosecutes violations of the Municipal Code, manages the cost of legal services, and supports the City Council in the development and adoption of policy. Key Responsibilities Provide oral and written advice and opinions as requested. Review and prepare ordinances, resolutions, contracts, written opinions, and agreements. Enforce the city code and prosecute violators. Review and process claims against the City, including legal defense in selected situations. Initiate legal action when deemed necessary or proper by the City Council. Provide timely legal advice to the City’s advisory bodies and staff. Provide all-purpose litigation capability on behalf of the City. More information on Best, Best and Krieger can be found at https://www.bbklaw.com/ Contact Us Visit Best, Best and Krieger Council Appointed Officer Trevor Rusin City Attorney",
    "depth": 4,
    "scraped_at": "2025-04-03 18:50:09"
  },
  "lomitacity.com_city-clerk": {
    "url": "https://lomitacity.com/city-clerk/",
    "title": "Office of the City Clerk - City of Lomita",
    "content": "Office of the City Clerk Kalee Cummings 2025-03-18T20:02:13-07:00 The mission of the Lomita City Clerk’s Office is to provide quality services to all customers, both internal and external in an ethical, impartial, and professional manner. We will conduct municipal elections with the highest integrity, effectively manage all official records of the City, and provide accessible legislative services to all, including our obligation to inform and notify the public. Key responsibilities: Maintain all official City documents, archives and legislative history Conduct and certify all municipal elections Administer oaths of office Manage legal requirements for public notice and for the filing of referenda, initiatives, recall petitions, annual Statements of Economic Interest and Campaign Disclosure Statements. Agendas & Minutes Bids & RFPs Boards & Commissions City Council Districting Resources Elections & Voter Information Ethics & Regulations Municipal Code Public Notices Public Records Requests Contact Us Lomita City Hall 24300 Narbonne Ave. Lomita, CA 90717 Phone: (310) 325-7110 Office Staff Members Kathleen Horn Gregory, MMC, City Clerk k.gregory@lomitacity.com Linda Abbott, CMC, Deputy City Clerk l.abbott@lomitacity.com",
    "depth": 4,
    "scraped_at": "2025-04-03 18:50:14"
  },
  "lomitacity.com_current-bids-rfps": {
    "url": "https://lomitacity.com/current-bids-rfps/",
    "title": "Current Bids & RFPs - City of Lomita",
    "content": "Current Bids & RFPs Kalee Cummings 2025-02-11T14:09:12-08:00 RFP: Engineering Services for Sewer System Management Plan The City of Lomita is seeking proposals from qualified and experienced civil engineering firms to provide Engineering Services for developing the City’s State-required Sewer System Management Plan. RFP Submission Deadline: Tuesday, February 25, 2025 at 1:00 p.m. Questions related to this RFP should be emailed to the Public Works Department at publicworks@lomitacity.com no later than Monday, February 3, 2025, at 1:00 p.m. Engineering Services for Sewer System Management Plan RFP Addendum No. 1 RFP: Urban Forestry & Inventory Services The City of Lomita is seeking proposals for Urban Forestry & Inventory Services RFP Submission Deadline: Wednesday, November 13, 2024 at 1:00 p.m. Questions related to this RFP shall be emailed to the Public Works Department at: publicworks@lomitacity.com , and j.vida@lomitacity.com no later than Wednesday , October 30, 2024 at 1:00 p.m. Urban Forestry & Inventory Services RFP Addendum No. 1",
    "depth": 5,
    "scraped_at": "2025-04-03 18:50:18"
  },
  "lomitacity.com_districting-resources": {
    "url": "https://lomitacity.com/districting-resources/",
    "title": "Districting Resources - City of Lomita",
    "content": "Districting Resources Sara Madsen 2023-05-08T18:40:50-07:00 On May 2, 2023, the City of Lomita City Council adopted Ordinance No. 848, implementing a by-district election system. A new district map was selected along with its election sequence: Districts 2 and 4 are up for election in 2024, and Districts 1, 3 and 5 are up for election in 2026. The City Council will continue to select the Mayor each year to serve a one-year term. While the district formation process is complete, these pages remain live to serve as an archive of the election changes including the schedule, draft maps and resources. News Lomita City Council Adopts Five-District Map, Approves Transition to District Based Elections Kylie Benzing 2023-05-08T18:45:16-07:00 May 8, 2023 | On May 2, 2023, Lomita’s City Council adopted an ordinance [...] Read More Lomita Considers City Council Districts, Residents Encouraged to Provide Input at Upcoming Meetings Kylie Benzing 2023-01-18T20:56:14-08:00 January 18, 2023 | The City of Lomita continues to seek input on its [...] Read More Lomita Offers Online Mapping Tool for Residents to Draw City Council District Maps Sydni Overly 2022-09-08T18:36:46-07:00 August 31, 2022 | As the City of Lomita continues exploring the transition to [...] Read More Lomita Considers City Council Districts, First Public Hearing Scheduled for August 16 Sydni Overly 2022-08-17T20:56:46-07:00 August 15, 2022 | The City of Lomita is considering the transition to City [...] Read More Community Workshops Public Comments Public comments received regarding the district formation process will be added to the Calendar Page .",
    "depth": 5,
    "scraped_at": "2025-04-03 18:50:30"
  },
  "lomitacity.com_elections": {
    "url": "https://lomitacity.com/elections/",
    "title": "Elections & Voter Information - City of Lomita",
    "content": "Elections & Voter Information Kalee Cummings 2024-10-24T20:11:28-07:00 City of Lomita General Municipal Election Tuesday, November 5, 2024 Lomita Park Serves as a 4-day Vote Center for the November 2024 Election The Tom Rico Community Room, located at Lomita Park, 24428 Eshelman Avenue, will be open as a 4-day vote center beginning Saturday, November 2, 2024, through Election Day on Tuesday, November 5, 2024.  The hours of operation will be from 10:00 a.m. to 7:00 p.m. with extended hours until 8:00 on election day.  Residents can vote at any election center in the Los Angeles County area or can drop off ballots at any ballot box until 8:00 p.m. on election day. There is a ballot box located in front of the Lomita Library, 24200 Narbonne Avenue. For more vote center information, click on the following link: https://www.lavote.gov/home/voting-elections/current-elections/find-my-election-information CITY OF LOMITA CANDIDATE INFORMATION GENERAL MUNICIPAL ELECTION TUESDAY, NOVEMBER 5, 2024 OFFICES UP FOR ELECTION: One Council seat in District No. 2 for a 4-year term One Council seat in District No. 4 for a 4-year term GENERAL QUALIFICATIONS : Must be a United States Citizen Must be at least 18 years of age Must be a registered voter residing in one of the listed districts at the time the nominations papers are issued. FILING PERIOD: (Elections Code 10220) Nomination period opens: Monday, July 15, 2024 Nomination period closes: Friday, August 9, 2024 Appointments should be made by calling the City Clerk’s Office at (310) 325-7110. Nomination papers shall have not less than 20 signatures nor more than 30 signatures of registered voters in the City of Lomita. Signatures must be obtained from registered voters residing in the same district. For more information, please contact the City Clerk’s Office at (310) 325-7110.  City Clerk’s Office hours are: Monday-Thursday 7:30 a.m. to 5:30 p.m. and alternating Fridays 8:00 a.m. to 5:00 p.m.  Lomita City Hall is closed alternating Fridays. Filer Date Filed Date Due Statement Type Position Ruben Lechuga September 25, 2024 September 26, 2024 Pre-election City Council Bill Uphoff September 25, 2024 September 26, 2024 Pre-election City Council Barry Waite September 25, 2024 September 26, 2024 Pre-election City Council Kyle Wade September 26, 2024 September 26, 2024 Pre-election City Council Bill Uphoff October 22, 2024 October 24, 2024 Pre-election City Council Barry Waite October 24, 2024 October 24, 2024 Pre-election City Council Kyle Wade October 24, 2024 October 24, 2024 Pre-election City Council List of potential candidates List of certified candidates The City of Lomita General Municipal Elections are held in November of even-numbered years. spacer District Maps Nominees for Public Office Notice of Election Register to Vote or Check Your Status Find Your Vote Center Voter’s Edge California Fair Political Practices Commission Secretary of State Past Election Information",
    "depth": 5,
    "scraped_at": "2025-04-03 18:50:35"
  },
  "lomitacity.com_ethics-regulations": {
    "url": "https://lomitacity.com/ethics-regulations/",
    "title": "Ethics Regulations - City of Lomita",
    "content": "Ethics Regulations Kalee Cummings 2025-02-04T11:01:04-08:00 Political Reform Act – Government Code Section 87505 Compliance Statement of Economic Interests The Political Reform Act of 1974 requires persons holding specified public offices to file disclosures of investments, real property interests, and income within specified periods of assuming or leaving office and annually while holding the office. Elected officials are required by State Law to file their Statements of Economic Interests – Form 700 with the City Clerk, who makes and retains a copy of each statement and forwards the original to the California Fair Political Practices Commission, which is the filing officer. Every elected official and public employee who makes or influences governmental decisions is required to submit a Statement of Economic Interest, also known as the Form 700. The Form 700 provides transparency and ensures accountability in two ways: It provides necessary information to the public about an official’s personal financial interests to ensure that officials are making decisions in the best interest of the public and not enhancing their personal finances. It serves as a reminder to the public official of potential conflicts of interest so the official can abstain from making or participating in governmental decisions that are deemed conflicts of interest. Copies of these statements may be obtained by visiting the City of Lomita City Clerk’s Office located at 24300 Narbonne Avenue, Lomita, CA 90717. Campaign Disclosure Filings The Political Reform Act of 1974 (Act) requires the filing of specified statements, reports and other documents by public officials, whether elected or appointed. Assembly Bill No. 2151 (Gallagher) approved by the Governor of California on September 28, 2020, added Government Code § 84616 to the Act. Effective January 1, 2021, local governmental agencies are required to post campaign statements and reports on their agency’s website, within 72 hours of each applicable filing deadline – please see relevant code section below. 84616. (a) Within 72 hours of each applicable filing deadline, a local government agency shall post on its internet website a copy of any statement, report, or other document required by Chapter 4 (commencing with Section 84100) that is filed with that agency in paper format. If the final day of the 72-hour period is a Saturday, Sunday, or holiday, the period is extended to the next day that is not a Saturday, Sunday, or holiday. Before posting, the local filing officer shall redact the street name and building number of the persons or entity representatives listed on any statement, report, or document, or any bank account number required to be disclosed by the filer. Providing a link on the agency’s internet website to the statement, report, or other document satisfies this subdivision. (b) A statement, report, or other document posted pursuant to this section shall be made available for four years from the date of the election associated with the filing. (Added by Stats. 2020, Ch. 214, Sec. 1. (AB 2151) Effective January 1, 2021.) Filer Date Filed Date Due Statement Type Position Mark Waronek January  31, 2025 January 31, 2025 Semi-Annual Form 460 City Council William Uphoff January 13, 2025 January 31, 2025 Semi-Annual Form 460 City Council William Uphoff January 13, 2025 January 31, 2025 Semi-Annual Form 460 City Council James Gazeley January 7, 2025 January 31, 2025 Semi-Annual Form 460 City Council Mark Waronek August 1, 2024 July 31, 2024 Semi-Annual Form 460 City Council James Gazeley July 31, 2024 July 31, 2024 Semi-Annual Form 460 City Council Barry Waite July 30, 2024 July 31, 2024 Semi-Annual Form 460 City Council Mark Waronek January 31, 2024 January 31, 2024 Semi-Annual Form 460 City Council Barry Waite January 31, 2024 January 31, 2024 Semi-Annual Form 460 City Council James Gazeley January 16, 2024 January 31, 2024 Semi-Annual Form 460 City Council Mark Waronek July 31, 2023 July 31, 2023 Semi-Annual Form 460 City Council Barry Waite July 18, 2023 July 31, 2023 Semi-Annual Form 460 City Council James Gazeley July 6, 2023 July 31, 2023 Semi-Annual Form 460 City Council Mark Waronek January 31, 2023 January 31, 2023 Semi-Annual Form 460 City Council Barry Waite January 31, 2023 January 31, 2023 Semi-Annual Form 460 City Council James Gazeley January 23, 2023 January 31, 2023 Semi-Annual Form 460 City Council Mark Waronek August 1, 2022 August 1, 2022 Semi-Annual Form 460 City Council Barry Waite July 27, 2022 August 1, 2022 Semi-Annual Form 460 City Council James Gazeley July 13, 2022 August 1, 2022 Semi-Annual Form 460 City Council Mark Waronek January 31, 2022 January 31, 2022 Semi-Annual Form 460 City Council Barry Waite January 27, 2022 January 31, 2022 Semi-Annual Form 460 City Council James Gazeley January 12, 2022 January 31, 2022 Semi-Annual Form 460 City Council Mark Waronek August 2, 2021 August 2, 2021 Semi-Annual Form 460 City Council Barry Waite July 14, 2021 August 2, 2021 Semi-Annual Form 460 City Council James Gazeley July 6, 2021 August 2, 2021 Semi-Annual Form 460 City Council Mark Waronek February 1, 2021 February 1, 2021 Semi-Annual Form 460 City Council Barry Waite January 21, 2021 February 1, 2021 Semi-Annual Form 460 City Council James Gazeley January 11, 2021 February 1, 2021 Semi-Annual Form 460 City Council Additional Resources FPPC Resources City Resources FPPC Resources FPPC 2020-2021 Form FPPC Reference Pamphlet FPPC’s Toll-Free: 1-866-275-3772 Form 700 Frequently Asked Questions Agency Report of Public Official Appointments – Form 806 City Resources City of Lomita Conflict of Interest Code",
    "depth": 5,
    "scraped_at": "2025-04-03 18:50:40"
  },
  "lomitacity.com_public-records-requests": {
    "url": "https://lomitacity.com/public-records-requests/",
    "title": "Public Records Requests - City of Lomita",
    "content": "Public Records Requests Kalee Cummings 2021-10-21T21:21:08-07:00 The City Clerk, acting as the official custodian of records for the City of Lomita, accepts requests for public records and coordinates with appropriate departments to make sure all requests are provided within the legal time frame. Please note, requests too general in nature, i.e., “all files relating to”, etc. may result in a delay pending further clarification of the records requested. Examples of information that may expedite the process: Name or title of the document, i.e., Resolution 2012-13; an address or property location; developer name; and/or date of Council/Planning Commission action. There is no charge for electronic copies. However, a hard copy printout will cost $.10 per page, which will be billed in advance. Contact Information for Public Records Requests Download Public Records Request Form Email Requests to: l.abbott@lomitacity.com and cc: k.gregory@lomitacity.com Mail & Hand Delivered Requests to: City of Lomita Office of the City Clerk 24300 Narbonne Avenue Lomita CA 90717 Documents Provided on the City’s Website Agendas & Minutes Municipal Code Fiscal Year Budgets",
    "depth": 5,
    "scraped_at": "2025-04-03 18:50:44"
  },
  "lomitacity.com_capital-improvement-program": {
    "url": "https://lomitacity.com/capital-improvement-program/",
    "title": "Capital Improvement Projects - City of Lomita",
    "content": "Capital Improvement Projects Melanie Moore 2025-02-20T10:30:20-08:00 The purpose of the City’s Capital Improvement Project (CIP) is to identify projects and funding sources, to strategically plan and prioritize projects within a budget to maximize the efficient use of funds and to preserve existing publicly-owned property and infrastructure. The City Council adopted the 5 year CIP program in June 2022. Click below to see all City Council approved documents related to the CIP plan. CIP Plan Documents The links below include the City Council staff report dated June 2022, the powerpoint presentation from that same meeting and the CIP plan itself. Capital Improvement Program FY 2022 – 2027 City Council Report dated June 21, 2022: Discussion and Consideration of the 2022 CIP Master Plan Capital Improvement Program Master Plan Workshop – 2022 Presentation – April 26, 2022 Interactive CIP Map Over the past year, several important projects have been completed, focusing on streets, parks, water infrastructure and public safety enhancements. The City is also in the analysis, design and construction phase for a number of projects. Click the map below to learn more! Projects in the planning phase are attached to green buttons, projects under construction are attached to yellow buttons and completed projects are attached to blue buttons. Pavement Management Program The City most recently completed its Pavement Management Program update in March 2024. A Pavement Management Program (PMP) is a planning tool to track the past, present and future pavement conditions and street maintenance and rehabilitation projects in a central database, utilizing engineering software to forecast pavement maintenance needs and assist in budgeting for street maintenance. The PMP ensures that the City is prioritizing roadway repairs to best serve the community in a cost effective manner. Per the PMP, the City’s street conditions are measured according to its Pavement Condition Index (PCI). The City has completed a number of street improvement projects over the past 3 years. Due to these improvements, the City’s overall street condition network has improved since the last PMP in 2017 which demonstrates the City’s commitment to improving street pavement conditions. The table below shows the improvement in PCI since 2011. Street Type PCI in 2024 PCI in 2021 PCI in 2017 PCI in 2014 PCI in 2011 Overall (City-wide) 74.8 72.5 69.3 61.8 59.2 Arterial Street Network An arterial street is defined as typically having four or more through travel lanes. These include Pacific Coast Highway, Lomita Boulevard, Crenshaw Boulevard, Western Avenue and Palos Verdes Drive North. 85.1 85.2 73.7 70.2 66.8 Local Street Network Local streets are subordinate to the basic circulation system and consist primarily of residential streets throughout the City. 70.3 69.2 68.1 59.2 56.9 Alleys Alleys were evaluated starting with the 2024 report. 61.0 N/A N/A N/A N/A Click on the links below to see the PMP plans: Pavement Management System Update (2024) Pavement Management System Update (2021) Pavement Management System Update (2017) Pavement Management System Update (2014) Pavement Management System Update (2011) Additional Resources: Bike and Pedestrian Master Plan (2018)",
    "depth": 4,
    "scraped_at": "2025-04-03 18:50:59"
  },
  "lomitacity.com_wp-content_uploads_2024_02_CIP-Master-Plan-20220614.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/02/CIP-Master-Plan-20220614.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/02/CIP-Master-Plan-20220614.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:02"
  },
  "lomitacity.com_wp-content_uploads_2024_02_CIP-Master-Plan-Staff-Report.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/02/CIP-Master-Plan-Staff-Report.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/02/CIP-Master-Plan-Staff-Report.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:05"
  },
  "lomitacity.com_wp-content_uploads_2024_02_CIP-Master-Plan-Workshop-slides-v2.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/02/CIP-Master-Plan-Workshop-slides-v2.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/02/CIP-Master-Plan-Workshop-slides-v2.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:08"
  },
  "lomitacity.com_wp-content_uploads_2024_08_Final-2024-Lomita-PMP-Report-3-22-24-rev5.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2024/08/Final-2024-Lomita-PMP-Report-3-22-24-rev5.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2024/08/Final-2024-Lomita-PMP-Report-3-22-24-rev5.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:11"
  },
  "lomitacity.com_wp-content_uploads_2021_11_Final-PMP-2020.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/11/Final-PMP-2020.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/11/Final-PMP-2020.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:14"
  },
  "lomitacity.com_wp-content_uploads_2021_11_Final-Approved-PMP-2017.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/11/Final-Approved-PMP-2017.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/11/Final-Approved-PMP-2017.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:17"
  },
  "lomitacity.com_wp-content_uploads_2021_11_Pavement-Management-Plan-Final-2014.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/11/Pavement-Management-Plan-Final-2014.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/11/Pavement-Management-Plan-Final-2014.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:21"
  },
  "lomitacity.com_wp-content_uploads_2021_11_Final-Pavement-Mangement-Report-Citywide-Submittal-12-10-1": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/11/Final-Pavement-Mangement-Report-Citywide-Submittal-12-10-11.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/11/Final-Pavement-Mangement-Report-Citywide-Submittal-12-10-11.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:23"
  },
  "lomitacity.com_wp-content_uploads_2021_11_Lomita-BPMP_Final2.pdf": {
    "url": "https://lomitacity.com/wp-content/uploads/2021/11/Lomita-BPMP_Final2.pdf",
    "title": "https://lomitacity.com/wp-content/uploads/2021/11/Lomita-BPMP_Final2.pdf",
    "content": "",
    "depth": 5,
    "scraped_at": "2025-04-03 18:51:26"
  }
}